gap> arc:=ArcPresentation(PureCubicalKnot(11,1));
[ [ 2, 9 ], [ 1, 3 ], [ 2, 6 ], [ 4, 7 ], [ 3, 5 ], [ 6, 10 ], [ 4, 8 ], 
  [ 9, 11 ], [ 7, 10 ], [ 1, 8 ], [ 5, 11 ] ]
gap> k:=KnotComplementWithBoundary(arc);
Map of regular CW-complexes

gap> Size(Source(i));
616
gap> Size(Target(i));
1043
