Repository: pypi-data/pypi-mirror-386
Catalog: packages/csu/csu-1.18.6.tar.gz/csu-1.18.6/src/csu/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Invalid Authorization header: no credentials provided.
ro: Header Authorization invalid: este gol.

source: Invalid Authorization header: token contains spaces.
ro: Header Authorization invalid: token-ul conține spații.

source: Invalid Authorization header: token contains invalid characters.
ro: Header Authorization invalid: token-ul conține caractere invalide.

source: Invalid Authorization header: token invalid.
ro: Header Authorization invalid: token invalid.

source: Ensure this field has only latin characters.
ro: Asigurați-vă că acest câmp are doar caractere latine.

source: Ensure this field has only digits.
ro: Asigurați-vă că acest câmp are doar cifre.

source: Leasing registration number is expired: {year}/{month} is less than {current_year}/{current_month}.
ro: Numărul de înmatriculare de tip leasing este expirat: {year}/{month} este mai mic ca {current_year}/{current_month}.

source: Leasing registration number has invalid year: {year}.
ro: Numărul de înmatriculare de tip leasing are anul invalid: {year}.

source: Leasing registration number has invalid month: {month}.
ro: Numărul de înmatriculare de tip leasing are lună invalidă: {month}.

source: Leasing registration number must include expiry date (YY/MM).
ro: Numărul de înmatriculare de tip leasing trebuie să includă data de expirare (AA/LL).

source: Cannot contain the letter Q.
ro: Nu poate conține litera Q.

source: Letters sequence cannot start with I.
ro: Grupul de litere nu poate începe cu I.

source: Letters sequence cannot start with O.
ro: Grupul de litere nu poate începe cu O.

source: Invalid registration number.
ro: Număr înmatriculare invalid.

source: Chassis number must have {required_length} characters ({length} given).
ro: Seria de șasiu trebuie să aibă {required_length} caractere ({length} au fost date).

source: Chassis number cannot contain the letter '{letter}'.
ro: Seria de șasiu nu poate conține litera '{letter}'.

source: '{input}' is not a valid choice. Must be one of: {opts}.
ro: '{input}' nu este o alegere validă. Trebuie să fie una din: {opts}.

source: '{input}' is not a valid choice. Must be one of: {opts} or {last_opt}.
ro: '{input}' nu este o alegere validă. Trebuie să fie una din: {opts} sau {last_opt}.

source: Invalid phone number.
ro: Număr telefon invalid.

source: Invalid phone number: {error}.
ro: Număr telefon invalid: {error}.

source: Invalid phone number: type is {type}.
ro: Număr telefon invalid: este de tip {type}.

source: '{country_code}' is not an accepted code.
ro: '{country_code}' nu este un cod acceptat.

source: too short to be a phone number
ro: prea scurt ca să fie un număr de telefon

source: too long to be a phone number
ro: prea lung ca să fie un număr de telefon

source: This field is unexpected.
ro: Acest câmp nu se poate trimite.

source: Must have a true value.
ro: Trebuie să fie o valoare adevărată.

source: Confirm time limit expired.
ro: Timpul limită pentru confirmare a expirat.

source: Cannot cancel.
ro: Nu se poate anula.

source: Ensure this field has at least {min_length} characters.
ro: Asigurați-vă că acest câmp are cel puțin {min_length} caractere.

source: created at
ro: creat la

source: modified at
ro: modificat la

source: confirmed at
ro: confirmat la

source: cancelled at
ro: anulat la

source: price
ro: preț

source: vat
ro: tva

source: The percentage of VAT.
ro: Procentajul TVA.

source: All
ro: Toate
