Repository: pypi-data/pypi-mirror-386
Catalog: packages/python-docs-theme/python_docs_theme-2025.10.tar.gz/python_docs_theme-2025.10/python_docs_theme/locale/*/LC_MESSAGES/python-docs-theme.po
Languages: fr

source: The Python Software Foundation is a non-profit corporation.
fr: La Python Software Foundation est une association à but non lucratif.

source: Please donate.
fr: Elle vit de vos dons.

source: Quick search
fr: Recherche rapide

source: Go
fr: Rechercher

source: Theme
fr: Thème

source: Light
fr: Clair

source: Dark
fr: Sombre

source: This page is licensed under the Python Software Foundation License Version 2.
fr: La licence de cette page est la Python Software Foundation License Version 2.

source: Examples, recipes, and other code in the documentation are additionally licensed under the Zero Clause BSD License.
fr: La licence des exemples, recettes, et autres morceaux de code se trouvant dans la documentation est la Zero Clause BSD License.

source: See <a href="%(license_file)s">History and License</a> for more information.
fr: Pour plus d'informations, consultez <a href="%(license_file)s">Histoire et licence</a>.

source: Hosted on %(hosted_on)s.
fr: Hébergé sur %(hosted_on)s.

source: Last updated on %(last_updated)s.
fr: Dernière mise à jour : %(last_updated)s.

source: <a href="%(theme_issues_url)s">Found a bug</a>?
fr: <a href="%(theme_issues_url)s">Un bogue</a> ?

source: Created using <a href="https://www.sphinx-doc.org/">Sphinx</a> %(sphinx_version)s.
fr: Crée par <a href="https://www.sphinx-doc.org/">Sphinx</a> %(sphinx_version)s.

source: Copy
fr: Copier

source: Copy to clipboard
fr: Copier dans le presse-papier

source: Copied!
fr: Copié !
