Repository: pypi-data/pypi-mirror-386
Catalog: packages/oarepo-ui/oarepo_ui-6.0.0.dev16-py3-none-any.whl/oarepo_ui/translations/*/LC_MESSAGES/messages.po
Languages: cs

source: api.draft
cs: API pracovního záznamu

source: api.latest
cs: API poslední verze záznamu

source: api.latest_html
cs: Stránka poslední verze záznamu

source: api.publish
cs: API pro publikování záznamu

source: api.record
cs: API této verze záznamu

source: api.self_html
cs: Stránka této verze záznamu

source: api.versions
cs: API všech verzí záznamu

source: Record details
cs: Detaily záznamu

source: New item
cs: Nový záznam

source: Edit item
cs: Editace záznamu

source: Close menu
cs: Zavřít menu

source: Requests
cs: Žádosti

source: Inbox
cs: Příchozí

source: Log in
cs: Přihlásit se

source: Sign up
cs: Registrovat se

source: My account
cs: Můj účet

source: Log out
cs: Odhlásit se

source: Search results
cs: Výsledky vyhledávání

source: Powered by <a href="%(link)s">Invenio</a>
cs: Založeno na repozitářové platformě <a href=“%(link)s”>Invenio</a>

source: Remove field
cs: Odstranit položku

source: Language
cs: Jazyk

source: Search for a language by name (e.g "eng", "fr" or "Polish")
cs: Hledat jazyk dle jména

source: Add another language
cs: Přidat další jazyk

source: We couldn't find any matches for
cs: Nenašli jsme žádné shody pro

source: search
cs: hledat

source: Choose
cs: Vybrat

source: Selected records
cs: Vybrané záznamy

source: Something went wrong...
cs: Něco se pokazilo…

source: Search...
cs: Hledat …

source: No results found
cs: Nenalezeny žádné výsledky

source: Loading...
cs: Nahrávám …

source: Search External Database
cs: Hledat v externím zdroji

source: Search results from external API
cs: Hledat v externím zdroji

source: Draft saved with validation errors. Fields listed below that failed validation were not saved to the server
cs: Pracovní verze záznamu byla uložena s chybami. Následující pole nebyla uložena, prosím, opravte je a uložte znovu

source: Draft saved successfully.
cs: Koncept byl uložen.

source: Draft published successfully. Redirecting to record's detail page ...
cs: Koncept byl úspěšně publikován. Budete přesměrováni na stránku s detailem záznamu …

source: Draft deleted successfully. Redirecting to the main page ...
cs: Koncept byl úspěšně smazán. Za okamžik Vás přesměrujeme na hlavní stránku.

source: Draft was saved but could not be published due to following validation errors
cs: Koncept byl uložen, ale nemohl být publikován kvůli následujícím chybám ověření:

source: Start over
cs: Začít znovu

source: resultsPerPage
cs: Výsledků na stránku

source: Filters
cs: Filtry

source: Filter results
cs: Filtrovat výsledky

source: Sort by
cs: Řazení

source: Sort
cs: Řazení

source: Value
cs: Hodnota

source: totalResults_one
cs: {{count}} výsledek

source: totalResults_few
cs: {{count}} výsledky

source: totalResults_many
cs: {{count}} výsledků

source: totalResults_other
cs: {{count}} výsledků

source: Clear all filters
cs: Vymazat všechny filtry

source: totalResults
cs: {{count}} výsledek

source: Open definition
cs: Otevřít definici

source: YYYY
cs: RRRR

source: YYYY-MM
cs: RRRR-MM

source: YYYY-MM-DD
cs: RRRR-MM-DD

source: Format: YYYY-MM-DD/YYYY-MM-DD, YYYYY-MM/YYYY/MM or YYYY/YYYY.
cs: Formát: RRRR-MM-DD/RRRR-MM-DD, RRRR-MM/RRRR/MM nebo RRRR/RRRR.

source: Select date range
cs: Vyberte časové období

source: Format: YYYY-MM-DD, YYYYY-MM or YYYY.
cs: Formát: RRRR-MM-DD, RRRR-MM nebo RRRR.

source: Select date
cs: Vyberte datum

source: All document records
cs: Všechny záznamy s dokumentem

source: in
cs: v

source: Search
cs: Hledat

source: Contact
cs: Kontakt

source: Powered by <a href="%(link)s">Invenio</a>
cs: Založeno na technologii <a href="%(link)s">Invenio</a>

source: Quick create
cs: Rychlé vytvoření

source: Actions
cs: Akce

source: Delete
cs: Smazat

source: Cancel
cs: Zrušit

source: Are you sure you wish delete this draft?
cs: Jste si jisti chcete tento koncept smazat?

source: If you delete the draft, the work you have done on it will be lost.
cs: Pokud koncept smažete, práce, kterou jste na něm vykonali, bude ztracena.

source: Previous Month
cs: Předchozí měsíc

source: Next Month
cs: Příští měsíc

source: Choose a date range
cs: Vyberte časové období

source: Write a date range or click on the calendar icon to select it
cs: Napište časové období nebo jej vyberte kliknutím na ikonu kalendáře.

source: Write a date or click on the calendar icon to select it
cs: Napište datum nebo jej vyberte kliknutím na ikonu kalendáře.

source: Preview
cs: Náhled

source: Publish
cs: Publikovat

source: Are you sure you wish to publish this draft?
cs: Jste si jisti že chcete tento koncept publikovat?

source: Save
cs: Uložit

source: Validate form
cs: Zkontrolovat formulář

source: api.files
cs: API souborů

source: Missing title
cs: Chybí název

source: Not set
cs: Není poskytnuto

source: Select:
cs: Vybrat:

source: Choose a date.
cs: Vyberte datum.

source: Date range.
cs: Časové období.

source: Single date.
cs: Jediné datum.

source: Choose the time interval in which the event took place.
cs: Vyberte časový interval, ve kterém se událost odehrála.

source: Choose one date.
cs: Vyberte jedno datum.

source: Choose date range (From - To).
cs: Vyberte časové období (Od - Do).

source: Choose a date from the calendar by clicking on the input.
cs: Vyberte datum z kalendáře kliknutím na vstup.

source: Year
cs: Rok

source: Year and month
cs: Rok a měsíc

source: Year, month and date
cs: Rok, měsíc a datum

source: is a required field
cs: je povinné pole

source: Items must be unique
cs: Položky musí být jedinečné

source: Gone
cs: Záznam smazán

source: The record you are trying to access was removed. The metadata of the record is kept for archival purposes.
cs: Záznam, který se snažíte zobrazit, byl smazán. <br>Metadata záznamu jsou uložena pro archivní účely. <br>Potřebujete-li je, obraťte se na správce repozitáře.

source: You are previewing a new record version that has not yet been published.
cs: Prohlížíte si náhled nové verze záznamu, která ještě nebyla publikována.

source: Files
cs: Soubory

source: Your draft was saved. If you wish to preview it, please correct the following validation errors and click preview again:
cs: Váš koncept byl uložen. Pokud chcete zobrazit jeho náhled, opravte následující chyby ověření a znovu klikněte na náhled:

source: Once the record is published you will no longer be able to change record's files! However, you will still be able to update the record's metadata later.
cs: Jakmile bude záznam zveřejněn, již jej nebudete moci změnit soubory! Stále však budete moci aktualizovat metadata záznamu později.

source: Edit item
cs: Editace záznamu

source: File
cs: Soubor

source: Size
cs: Velikost

source: Your draft was saved. Redirecting to the preview page...
cs: Váš koncept byl uložen. Přesměrování na stránku náhledu...

source: Please provide an URL in valid format
cs: Zadejte prosím adresu URL v platném formátu

source: Identifiers and links
cs: Identifikátory a odkazy

source: metadata/originalRecord.label
cs: Odkaz na původní záznam

source: Links
cs: Odkazy

source: Not found
cs: Nenalezeno

source: The record you are trying to access does not exist in this repository.
cs: Záznam, který se snažíte zobrazit, neexistuje v tomto repozitáři.

source: Permission denied
cs: Přístup odepřen

source: You do not have permissions to access this page on %(sitename)s.
cs: Nemáte oprávnění k zobrazení této stránky na %(sitename)s.

source: Copied!
cs: Zkopírováno!

source: Copy to clipboard failed!
cs: Kopírování se nezdařilo!

source: Export
cs: Exportovat

source: Export selection
cs: Exportovat výběr

source: Download file
cs: Stáhnout soubor

source: Remove
cs: Odstranit

source: Version: %(version)s
cs: Verze repozitáře: %(version)s

source: Filter data by date
cs: Filtrovat podle data

source: Reset
cs: Resetovat

source: You have no permission to create record in this community.
cs: Nemáte právo vytvořit záznam v této komunitě.

source: Reason: %(error)s
cs: Důvod: %(error)s

source: Type and press enter to search
cs: Zadejte a stiskněte Enter pro vyhledávání

source: Your draft has validation errors. Please correct them and try again:
cs: Váš koncept obsahuje chyby ověření. Opravte je a zkuste to znovu:

source: Delete draft
cs: Smazat koncept

source: Draft deleted successfully. Redirecting to your dashboard ...
cs: Koncept byl úspěšně smazán. Přesměrování na vaši nástěnku ...

source: Draft saved with validation errors. Please correct the following issues and try again:
cs: Koncept byl uložen s validačními chybami. Opravte prosím následující problémy a zkuste to znovu:

source: Versions
cs: Verze

source: View all versions
cs: Zobrazit všechny verze

source: Failed to fetch draft's files. Please try refreshing the page.
cs: Soubory konceptu se nepodařilo načíst. Zkuste prosím obnovit stránku.

source: File uploaded successfully.
cs: Soubor byl úspěšně nahrán.

source: File was not uploaded correctly. Please delete it and try again.
cs: Soubor nebyl správně nahrán. Smažte jej a zkuste to znovu.

source: Status
cs: Stav

source: Fetching files
cs: Získávání souborů

source: You can import files from the previous version.
cs: Soubory můžete importovat z předchozí verze.

source: Import files
cs: Importovat soubory

source: Failed to import files from previous version. Please try again.
cs: Nepodařilo se importovat soubory z předchozí verze. Zkuste to prosím znovu.

source: <0>If you wish to upload files, you must </0><1>save</1><2> your draft first.</2>
cs: <0>Pokud chcete nahrát soubory, musíte nejprve </0><1>uložit</1><2> svůj koncept.</2>

source: You must create a new version to add, modify or delete files. It can be done on record's <2>detail</2> page.
cs: Pro přidání, úpravu nebo smazání souborů musíte vytvořit novou verzi. To lze provést na stránce <2>detailu</2> záznamu.

source: After publishing the draft, it is not possible to add, modify or delete files. It will be necessary to create a new version of the record.
cs: Po zveřejnění konceptu není možné přidávat, upravovat ani odstraňovat soubory. Bude nutné vytvořit novou verzi záznamu.

source: File name
cs: Název souboru

source: File size
cs: Velikost souboru

source: Edit file metadata
cs: Upravit metadata souboru

source: Delete file
cs: Smazat soubor

source: Upload files
cs: Nahrát soubory

source: Edit file
cs: Upravit soubor

source: Edit
cs: Upravit

source: Version {{- version}}
cs: Verze {{- version}}

source: Only published versions are displayed.
cs: Zobrazují se pouze zveřejněné verze.

source: An error occurred while fetching the record.
cs: Při načítání záznamu došlo k chybě.

source: An error occurred while fetching the versions.
cs: Při načítání verzí došlo k chybě.

source: View all {{count}} versions
cs: Zobrazit všechny {{count}} verze

source: <0><0>Cite all versions?</0> You can cite all versions by using the DOI <2>{{recordDraftParentDOIFormat}}</2>. The DOI is registered when the first version is published. <4>Read more</4>.</0>
cs: <0><0>Citovat všechny verze?</0> Všechny verze můžete citovat pomocí DOI <2>{{recordDraftParentDOIFormat}}</2>. DOI se registruje při zveřejnění první verze. <4>Přečtěte si více.</4></0>

source: <0><0>Cite all versions?</0> You can cite all versions by using the DOI <3><0>{{recordParentDOI}}</0></3>. This DOI represents all versions, and will always resolve to the latest one. <5>Read more</5>.</0>
cs: <0><0>Citovat všechny verze?</0> Všechny verze můžete citovat pomocí DOI <3><0>{{recordParentDOI}}</0></3>. Tento DOI reprezentuje všechny verze a vždy bude odkazovat na nejnovější verzi. <5>Přečtěte si více.</5></0>

source: Metrics
cs: Metriky

source: Views
cs: Zobrazení

source: Downloads
cs: Stažení

source: Show more details
cs: Zobrazit více informací

source: Show less details
cs: Zobrazit méně podrobností

source: All versions
cs: Všechny verze

source: This version
cs: Tato verze

source: Total views
cs: Celkový počet zobrazení

source: Total downloads
cs: Celkový počet stažení

source: Data volume
cs: Objem dat

source: Total data volume
cs: Celkový objem dat

source: More info on how stats are collected.
cs: Další informace o tom, jak se shromažďují statistiky.

source: Add
cs: Přidat

source: You are previewing a published record.
cs: Zobrazujete náhled zveřejněného záznamu.

source: You are previewing changes that have not yet been published.
cs: Zobrazujete náhled změn, které ještě nebyly zveřejněny.

source: You are previewing a new record that has not yet been published.
cs: Zobrazujete náhled nového záznamu, který ještě nebyl zveřejněn.

source: File is being processed.
cs: Soubor se zpracovává.

source: Preview file
cs: Náhled souboru

source: Click to copy
cs: Kliknutím zkopírujete

source: ResearcherID
cs: ResearcherID (Web of Science)

source: CzenasAutID
cs: Národní autorita (czenasAutID)

source: vedIDK
cs: Vedidk (IS VaVaI)

source: InstitutionalID
cs: Institucionální ID (institutionalID)

source: ICO
cs: IČO

source: Both identifier and identifier type must be filled.
cs: Musí být vyplněn identifikátor i typ identifikátoru.

source: Add identifier
cs: Přidat identifikátor

source: Copy to clipboard
cs: Kopírovat do schránky

source: Search or create affiliation
cs: Hledat nebo vytvořit afiliaci

source: Affiliations
cs: Afiliace

source: Search for affiliations..
cs: Hledat afiliace...

source: Add creator
cs: Přidat tvůrce

source: Add contributor
cs: Přidat přispěvatele

source: Edit creator
cs: Upravit tvůrce

source: Edit contributor
cs: Upravit přispěvatele

source: Creators
cs: Autoři

source: Type the value of an identifier...
cs: Zadejte hodnotu identifikátoru...

source: Identifiers
cs: Identifikátory

source: e.g. ORCID, ISNI or GND.
cs: např. ORCID, ISNI nebo GND.

source: Save and add another
cs: Uložit a přidat další

source: Family name is a required field.
cs: Příjmení je povinné pole.

source: Name is a required field.
cs: Křestní jméno je povinné pole.

source: Role is a required field.
cs: Role je povinné pole.

source: Added
cs: Přidáno

source: Person
cs: Osoba

source: Organization
cs: Organizace

source: Search for persons by name, identifier, or affiliation...
cs: Hledat osoby podle jména, identifikátoru nebo afiliace...

source: Family name
cs: Příjmení

source: Given names
cs: Křestní jména

source: In format scheme:identifier e.g. orcid:0000-0000-0000-0000
cs: Ve formátu schéma:identifikátor např. orcid:0000-0000-0000-0000

source: Search for an organization by name, identifier, or affiliation...
cs: Hledat organizaci podle jména, identifikátoru nebo afiliace...

source: Search for organization by name, identifier, or affiliation...
cs: Hledat organizaci podle jména, identifikátoru nebo afiliace...

source: Name
cs: Jméno

source: Organization name
cs: Název organizace

source: e.g. ROR, ISNI or GND.
cs: např. ROR, ISNI nebo GND.

source: Select role
cs: Vyberte roli

source: Couldn't find your person? You can <2>create a new entry</2>.
cs: Nemůžete najít osobu? Můžete <2>vytvořit nový záznam</2>.

source: Search for a funder by name
cs: Hledat poskytovatele financování podle jména

source: Funder
cs: Poskytovatel financování

source: Search for funder...
cs: Hledat poskytovatele financování...

source: File was not uploaded correctly.
cs: Soubor nebyl správně nahrán.

source: File upload is not completed.
cs: Nahrávání souborů nebylo dokončeno.

source: Removal reason
cs: Důvod odstranění

source: Note
cs: Poznámka

source: Citation text
cs: Citace

source: Given name is a required field.
cs: Křestní jméno je povinné pole.

source: Cite all versions?
cs: Citovat všechny verze?

source: You can cite all versions by using the DOI
cs: Všechny verze můžete citovat pomocí DOI

source: The DOI is registered when the first version is published.
cs: DOI se registruje při zveřejnění první verze.

source: Read more.
cs: Přečtěte si více.

source: This DOI represents all versions, and will always resolve to the latest one.
cs: Toto DOI zastupuje všechny verze a vždy bude odkazovat na tu nejnovější.

source: Something went wrong
cs: Něco se pokazilo

source: Error
cs: Chyba

source: An error occurred while rendering this component
cs: Došlo k chybě při vykreslování této komponenty

source: Please try refreshing the page or contact support if the problem persists.
cs: Obnovte stránku nebo kontaktujte podporu, pokud problém přetrvává.

source: Error loading facet
cs: Chyba při načítání facety

source: We couldn’t display this item.
cs: Tuto položku se nepodařilo zobrazit.

source: Please refresh the page, or contact support if the problem continues.
cs: Zkuste prosím stránku obnovit. Pokud problém přetrvává, kontaktujte podporu.

source: Record ID: {{pid}}
cs: ID záznamu: {{pid}}

source: Unable to load {{facet}} filter options
cs: Nepodařilo se načíst filtr {{facet}}

source: Organization name is a required field.
cs: Název organizace je povinné pole.

source: Clear
cs: Smazat

source: Notification preferences were updated.
cs: Předvolby oznámení byly aktualizovány.

source: The browser (or proxy) sent a request that this server could not understand.
cs: Prohlížeč (nebo proxy server) odeslal požadavek, kterému tento server nerozuměl.

source: The server could not verify that you are authorized to access the URL requested. You either supplied the wrong credentials (e.g. a bad password), or your browser doesn't understand how to supply the credentials required.
cs: Server nemohl ověřit, zda jste oprávněni přistupovat k požadované adrese URL. Buď jste zadali špatné přihlašovací údaje (např. špatné heslo), nebo váš prohlížeč nerozumí tomu, jak požadované přihlašovací údaje poskytnout.

source: You don't have the permission to access the requested resource. It is either read-protected or not readable by the server.
cs: Nemáte oprávnění k přístupu k požadovanému prostředku. Je buď chráněn proti čtení, nebo jej server nemůže přečíst.

source: The requested URL was not found on the server. If you entered the URL manually please check your spelling and try again.
cs: Požadovaná adresa URL nebyla na serveru nalezena. Pokud jste adresu URL zadali ručně, zkontrolujte prosím pravopis a zkuste to znovu.

source: The method is not allowed for the requested URL.
cs: Metoda není pro požadovanou adresu URL povolena.

source: The resource identified by the request is only capable of generating response entities which have content characteristics not acceptable according to the accept headers sent in the request.
cs: Prostředek identifikovaný požadavkem je schopen generovat pouze entity odpovědi, které mají charakteristiky obsahu, jež nejsou přijatelné podle hlaviček accept zaslaných v požadavku.

source: The server closed the network connection because the browser didn't finish the request within the specified time.
cs: Server ukončil síťové připojení, protože prohlížeč nedokončil požadavek v zadaném čase.

source: A conflict happened while processing the request. The resource might have been modified while the request was being processed.
cs: Při zpracování požadavku došlo ke konfliktu. Prostředek mohl být během zpracování požadavku změněn.

source: The requested URL is no longer available on this server and there is no forwarding address. If you followed a link from a foreign page, please contact the author of this page.
cs: Požadovaná adresa URL již na tomto serveru není k dispozici a neexistuje žádná adresa pro přesměrování. Pokud jste následovali odkaz z cizí stránky, kontaktujte prosím autora této stránky.

source: The precondition on the request for the URL failed positive evaluation.
cs: Předběžná podmínka v požadavku na adresu URL selhala při pozitivním vyhodnocení.

source: The data value transmitted exceeds the capacity limit.
cs: Přenášená hodnota dat překračuje kapacitní limit.

source: The length of the requested URL exceeds the capacity limit for this server. The request cannot be processed.
cs: Délka požadované adresy URL překračuje kapacitní limit tohoto serveru. Požadavek nelze zpracovat.

source: The server does not support the media type transmitted in the request.
cs: Server nepodporuje typ média přenášený v požadavku.

source: The server cannot provide the requested range.
cs: Server nemůže poskytnout požadovaný rozsah.

source: The server could not meet the requirements of the Expect header
cs: Server nemohl splnit požadavky hlavičky Expect

source: This server is a teapot, not a coffee machine
cs: Tento server je čajová konvice, ne kávovar

source: The request was well-formed but was unable to be followed due to semantic errors.
cs: Požadavek byl správně formulován, ale nebylo možné jej zpracovat kvůli sémantickým chybám.

source: The resource that is being accessed is locked.
cs: Prostředek, ke kterému se přistupuje, je uzamčen.

source: The method could not be performed on the resource because the requested action depended on another action and that action failed.
cs: Metodu nebylo možné na prostředku provést, protože požadovaná akce závisela na jiné akci a tato akce se nezdařila.

source: This request is required to be conditional; try using 'If-Match' or 'If-Unmodified-Since'.
cs: Tento požadavek musí být podmíněný; zkuste použít 'If-Match' nebo 'If-Unmodified-Since'.

source: This user has exceeded an allotted request count. Try again later.
cs: Tento uživatel překročil přidělený počet požadavků. Zkuste to znovu později.

source: One or more header fields exceeds the maximum size.
cs: Jedno nebo více polí záhlaví překračuje maximální velikost.

source: Unavailable for legal reasons.
cs: Nedostupné z právních důvodů.

source: The server encountered an internal error and was unable to complete your request. Either the server is overloaded or there is an error in the application.
cs: Server narazil na interní chybu a nemohl dokončit váš požadavek. Buď je server přetížen, nebo došlo k chybě v aplikaci.

source: The server does not support the action requested by the browser.
cs: Server nepodporuje akci požadovanou prohlížečem.

source: The proxy server received an invalid response from an upstream server.
cs: Proxy server obdržel neplatnou odpověď od nadřazeného serveru.

source: The server is temporarily unable to service your request due to maintenance downtime or capacity problems. Please try again later.
cs: Server je dočasně nedostupný z důvodu údržby nebo problémů s kapacitou. Zkuste to prosím znovu později.

source: The connection to an upstream server timed out.
cs: Vypršel časový limit připojení k nadřazenému serveru.

source: The server does not support the HTTP protocol version used in the request.
cs: Server nepodporuje verzi protokolu HTTP použitou v požadavku.

source: Draft could not be saved. Please try again later.
cs: Záznam nelze uložit. Zkuste to prosím znovu později

source: English
cs: angličtina

source: Czech
cs: čeština

source: File preview requested but file service is not available on the model
cs: Byl požadován náhled souboru, ale služba pro soubory není v modelu dostupná

source: No record found for the tombstone page
cs: Pro stránku se záznamem o odstranění nebyl nalezen žádný záznam

source: No record found for the tombstone page, incorrect parameter
cs: Pro stránku se záznamem o odstranění nebyl nalezen žádný záznam, nesprávný parametr

source: No record found for the tombstone page, no id
cs: Pro stránku se záznamem o odstranění nebyl nalezen žádný záznam, chybí ID
