Repository: pypi-data/pypi-mirror-386
Catalog: packages/invenio-vocabularies/invenio_vocabularies-8.3.1.tar.gz/invenio_vocabularies-8.3.1/invenio_vocabularies/assets/semantic-ui/translations/invenio_vocabularies/messages/*/messages.po
Languages: fi

source: Search for a funder by name
fi: Hae rahoittajaa nimellä

source: Funder
fi: Rahoittaja

source: Search for funder...
fi: Hae rahoittajaa...

source: Additional information
fi: Lisätiedot

source: optional
fi: valinnainen

source: Number
fi: Numero

source: Award/Grant number
fi: Palkinto-/apurahan numero

source: Title
fi: Otsikko

source: Award/Grant Title
fi: Palkinto-/apurahan nimi

source: Award/Grant URL
fi: Palkinto-/apurahan URL

source: Add
fi: Lisää

source: Add custom
fi: Lisää mukautettu

source: Edit
fi: Muokkaa

source: Remove
fi: Poista

source: Open external link
fi: Avaa ulkoinen linkki

source: Funder is required.
fi: Rahoittaja on pakollinen.

source: URL must be valid.
fi: URL-osoitteen on oltava kelvollinen.

source: URL must be set alongside title or number.
fi: URL on asetettava yhdessä otsikon tai numeron kanssa.

source: Add standard award/grant
fi: Lisää vakiopalkinto/apuraha

source: Add custom funding
fi: Lisää mukautettu rahoitus

source: Search for awards/grants
fi: Hae palkintoja/apurahoja

source: Cancel
fi: Peruuta

source: Change
fi: Muuta

source: Did not find your award/grant?
fi: Etkö löytänyt palkintoasi/apurahaa?

source: Add a custom award/grant.
fi: Lisää mukautettu palkinto/apuraha.
