# homalg, single 15
#
# DO NOT EDIT THIS FILE - EDIT EXAMPLES IN THE SOURCE INSTEAD!
#
# This file has been generated by AutoDoc. It contains examples extracted from
# the package documentation. Each example is preceded by a comment which gives
# the name of a GAPDoc XML file and a line range from which the example were
# taken. Note that the XML file in turn may have been generated by AutoDoc
# from some other input.
#
gap> START_TEST("homalg15.tst");

# doc/../gap/HomalgBigradedObject.gi:385-408
gap> zz := HomalgRingOfIntegers( );
Z
gap> M := HomalgMatrix( "[ 2, 3, 4,   5, 6, 7 ]", 2, 3, zz );;
gap> M := LeftPresentation( M );
<A non-torsion left module presented by 2 relations for 3 generators>
gap> d := Resolution( M );;
gap> dd := Hom( d );;
gap> C := Resolution( dd );;
gap> CC := Hom( C );
<A non-zero acyclic complex containing a single morphism of left cocomplexes a\
t degrees [ 0 .. 1 ]>
gap> B := HomalgBicomplex( CC );
<A non-zero bicomplex containing left modules at bidegrees [ 0 .. 1 ]x
[ -1 .. 0 ]>
gap> E0 := HomalgBigradedObject( B );
<A bigraded object containing left modules at bidegrees [ 0 .. 1 ]x
[ -1 .. 0 ]>
gap> Display( E0 );
Level 0:

 * *
 * *

#
gap> STOP_TEST("homalg15.tst", 1);
