Repository: pypi-data/pypi-mirror-386
Catalog: packages/clinicedc/clinicedc-2.0.40-py3-none-any.whl/edc_model_admin/locale/*/LC_MESSAGES/django.po
Languages: sw

source: add
sw: ongeza

source: Subject dashboard
sw: Dashibodi ya mgonjwa

source: Go to subject's dashboard
sw: nenda kwenye dashibodi ya mgonjwa

source: <A href="%(url)s">Dashboard</A>
sw: <A href="%(url)s">Dashibodi</A>

source: View
sw: Hakiki

source: Revert
sw: Rudisha

source: %(word)s %(verbose_name)s Audit Trail
sw: %(word)s %(verbose_name)s rekodi ya ukaguzi

source: Please complete the form below. Required questions are in bold. When all required questions are complete click SAVE or, if available, SAVE NEXT. Based on your responses, additional questions may be required or some answers may need to be corrected.
sw: Tafadhali jaza fomu iliyo hapa chini. Maswali yanayohitajika yameandikwa kwa herufi nzito. Maswali yote yanayohitajika yanapokamilika bofya HIFADHI au, ikiwa inapatikana, HIFADHI INAYOFUATA. Kulingana na majibu yako, maswali ya ziada yanaweza kuhitajika au baadhi ya majibu yanaweza kuhitaji kusahihishwa

source: Audit trail
sw: Rekodi ya ukaguzi

source: Additional Instructions
sw: Maagizo ya ziada

source: Notifications
sw: Arifa

source: Home
sw: Nyumbani

source: Administration
sw: Utawala

source: Delete
sw: Futa

source: Objects
sw: Vitu

source: Yes, Iâ€™m sure
sw: Ndiyo, nina uhakika

source: No, take me back
sw: Hapana, nirudishe

source: Recent actions
sw: Vitendo vya hivi karibuni

source: My actions
sw: Matendo yangu

source: None available
sw: Hakuna inayopatikana

source: Unknown content
sw: Maudhui yasiyojulikana

source: Current document
sw: Hati ya sasa

source: Delete?
sw: Futa?

source: Change
sw: Badilika

source: Licensed for use under
sw: Imepewa leseni ya matumizi chini ya

source: Revision
sw: Marudio

source: Save
sw: Hifadhi

source: Leave form without saving
sw: Ondoka fomu bila kuweka akiba

source: Cancel
sw: Ghairi

source: Save and go to next form in schedule
sw: Hifadhi na uende kwenye fomu inayofuata katika ratiba

source: Save and next
sw: Hifadhi na ijayo

source: Logout
sw: Ondoka

source: Go to user account
sw: Nenda kwa akaunti ya mtumiaji

source: You are at the subject dashboard
sw: Uko kwenye dashibodi ya mgonjwa
