Repository: pypi-data/pypi-mirror-386
Catalog: packages/pyams-auth-apikey/pyams_auth_apikey-2.1.2-py3-none-any.whl/pyams_auth_apikey/locales/*/LC_MESSAGES/pyams_auth_apikey.po
Languages: fr

source: API key: {}
fr: Clé d'API : {}

source: API keys authentication
fr: Authentification par clés d'API

source: API keys authentication plug-in
fr: Module d'authentification par clés d'API

source: Key name
fr: Nom de la clé

source: This name must be unique between all API keys; if empty, a random name will be used as name
fr: Le nom de la clé doit être unique, et il est utilisé notamment pour identifier cette clé en tant que mandataire ; s'il n'est pas indiqué, un nom aléatoire lui sera attribué

source: API key
fr: Clé d'API

source: This API key will never be displayed again, just copy it and keep it safe!
fr: La clé d'API ne sera jamais visible à nouveau, vous devez la copier et la conserver en sécurité !

source: API key hash
fr: Empreinte

source: This is a hash of the API key and can't be modified
fr: Cette clé de hashage identifie la clé et ne peut pas être modifiée

source: Enabled key?
fr: Clé active ?

source: Select 'no' to disable the key temporarily
fr: Sélectionnez 'non' pour désactiver cette clé temporairement

source: Key label
fr: Libellé

source: This label will be used to identify the key
fr: Ce libellé pourra être utilisé pour identifier la clé

source: Associated principal
fr: Mandataire associé

source: If defined, this will identify the principal which will be used when a request will be authenticated with this API key
fr: S'il est défini, ce mandataire sera utilisé en lieu et place de la clé pour authentifier les requêtes qui l'utiliseront

source: Selected principal can't be another API key!
fr: Le mandataire sélectionné ne peut pas être une autre clé d'API !

source: Activation date
fr: Date d'activation

source: This key will be enabled only after this date
fr: La clé ne sera active qu'à partir de cette date

source: Expiration date
fr: Date d'expiration

source: This key will not be enabled after this date
fr: La clé ne sera pas active au-delà de cette date

source: Restrict referrers
fr: Restreindre les référents

source: If this option is enabled, only selected referrers will be enabled
fr: Si cette option est activée, seuls les référents indiqués ci-dessous seront autorisés

source: Allowed referrers
fr: Référents autorisés

source: Only selected referrers will be allowed to use this API key
fr: Seules les requêtes dont l'origine correspond à l'un de ces référents seront authentifiées

source: Allowed as request param
fr: Autorisée comme paramètre de requête

source: If 'yes', this API key can be sent as a request URL parameter instead of an HTTP request header only
fr: Si 'oui', cette clé d'API pourra être transmise via un paramètre de requête et non seulement via un en-tête HTTP

source: Request param name
fr: Nom du paramètre

source: Name of the request parameter used to send this API key
fr: Nom du paramètre de la requête utilisé pour fournir la clé d'API

source: Enabled API key authentication?
fr: Activer l'authentification par clés d'API

source: Enable login via API keys
fr: Activer l'authentification par clés d'API

source: HTTP header
fr: En-tête HTTP

source: Name of the HTTP header used to provide the API key
fr: Nom de l'en-tête HTTP utilisé pour fournir la clé d'API

source: API keys configuration
fr: Configuration des clés d'API

source: API keys
fr: Liste des clés d'API

source: Click icon to enable or disable this API key
fr: Cliquer pour activer ou désactiver cette clé

source: Name
fr: Nom

source: Label
fr: Libellé

source: Principal
fr: Mandataire

source: Add API key
fr: Ajouter une clé d'API

source: New API key
fr: Nouvelle clé d'API

source: New API key properties
fr: Propriété de la nouvelle clé

source: Plug-in: API keys authentication
fr: Module : Authentification par clés d'API

source: WARNING: the API key won't be displayed after it's creation! You must copy it NOW and keep it safe!!
fr: ATTENTION : cette clé ne sera plus affichée après sa création ! Vous devez la copier MAINTENANT et la conserver en lieu sûr !!

source: This key name is already used!
fr: Ce nom de clé est déjà utilisé !

source: API key properties
fr: Propriété de la clé
