Repository: pypi-data/pypi-mirror-386
Catalog: packages/wbhuman_resources/wbhuman_resources-1.56.5-py2.py3-none-any.whl/wbhuman_resources/locale/*/LC_MESSAGES/django.po
Languages: de

source: <p>Submit Reviews</p> <p>Group : <b>{{name}}</b><p> From : <b>Stage 1: Preparation of review</b></p> <p> To : <b>Stage 2: Fill in review</b></p> <p style='background-color:skyblue;border-radius:2px;padding:5px;'> <b><span style=color:black> You are going to submit the reviews that are in stage 1 to stage 2 </span></b> </p>
de: <p>Bewertungen Einsenden</p> <p>Gruppe : <b>{{name}}</b><p> Von : <b>Abschnitt 1: Vorbereitung der Bewertung</b></p> <p> Bis : <b>Abschnitt 2: Ausfüllen des Bewertungsformulares</b></p> <p style='background-color:skyblue;border-radius:2px;padding:5px;'> <b><span style=color:black> Sie werden die Bewertungen, die sich in Abschnitt 1befinden, zu Abschnitt 2 einsenden </span></b> </p>

source: Color
de: Farbe

source: Settings
de: Einstellungen

source: Present
de: Anwesend

source: Absent
de: Abwesend

source: End
de: Ende

source: Height
de: Höhe

source: Parent Position
de: Elternposition

source: Groups
de: Gruppen

source: Requests
de: Anträge

source: Profile
de: Profil

source: Contract Type
de: Vertragsart

source: Active
de: Aktiv

source: Frequency
de: Frequenz

source: Periodic days
de: Periodische Tage

source: Balance ({current_year})
de: Guthaben ({current_year})

source: Telephone
de: Telefon

source: Email
de: E-Mail-Adresse

source: Address
de: Adresse

source: Persons
de: Personen

source: Parameters
de: Parameter

source: Evaluated Score
de: Evaluationsergebnis

source: Evaluation Date
de: Evaluationsdatum

source: Evaluated Period
de: Evaluationsperiode

source: Progression
de: Fortschritt

source: Question Categories
de: Fragenkategorien

source: ({count}/{total}). No Question Category
de: ({count}/{total}). Keine Fragenkategorie

source: Reviewee/ Reviewer/ Department/ Company
de: Geprüfte*r/Prüfer*in/Abteilung/Unternehmen

source: Great Difference
de: Großer Unterschied

source: Little Difference
de: Kleiner Unterschied

source: Peers
de: Kolleg*innen

source: <b>Parameters</b>: {}<br>{}
de: <b>Parameter</b>: {}<br>{}

source: Progress expected to reach goal
de: Erwarteter Fortschritt, um Ziel zu erreichen

source: Absence Graph
de: Abwesenheitsgraph

source: Presence Table
de: Anwesenheitstabelle

source: Add Requests
de: Anträge Hinzufügen

source: Request Types
de: Antragstypen

source: Add Request Types
de: Antragstyp Hinzufügen

source: Add Day Off
de: Freien Tag Hinzufügen

source: Add Employee
de: Angestellt*innen Hinzufügen

source: Add Position
de: Position Hinzufügen

source: KPI Evaluations
de: KPI Evaluationen

source: Add Group
de: Gruppe Hinzufügen

source: Employee Reviews
de: Mitarbeiter*innenbewertungen

source: Add Review
de: Bewertung Hinzufügen

source: Templates
de: Vorlagen

source: Add Template
de: Vorlage Hinzufügen

source: Categories
de: Kategorien

source: Add Question Category
de: Fragenkategorie Hinzufügen

source: Questions
de: Fragen

source: Add Question
de: Frage Hinzufügen

source: Answers
de: Antworten

source: Reviews successfully submitted
de: Bewertungen erfolgreich abgesendet

source: Review is going to be created from template:
de: Bewertung wird generiert von Vorlage:

source: PDF is going to be created and sent to you.
de: PDF wird erstellt und zu Ihnen gesendet.

source: Review is acknowledged by the reviewee
de: Bewertung wurde von dem*der Geprüften anerkannt

source: Review is acknowledged by the reviewer
de: Bewertung wurde von dem*der Prüfer*in anerkannt

source: Reviewee has finished answering the review questions
de: Geprüfte*r hat die Bewertungsfragen fertig beantwortet

source: Reviewer has finished answering the review questions
de: Prüfer*in hat die Bewertungsfragen fertig beantwortet

source: The fields <b>From</b>, <b>To</b>, <b>Deadline</b>, <b>Reviewee</b> and <b>Reviewer</b> have to be empty if <u><b> template is true </b></u> within a <b>Review Group</b>. They get filled in once the <b>Review Group</b> creates them.
de: Die Felder <b>Von</b>, <b>Bis</b>, <b>Frist</b>, <b>Geprüfte*r</b> und <b>Prüfer*in</b> müssen leer sein, wenn <u><b> Vorlage ausgewählt ist </b></u> innerhalb einer <b>Bewertungsgruppe</b>. Sie werden ausgefüllt sobald die <b>Bewertungsgruppe</b> sie erstellt.

source: It is recommended to add a comment for the answers whose rating is 'very bad', 'bad' or 'very good'
de: Es wird empfohlen, ein Kommentar für die Antworten, die mit "sehr schlecht", "schlecht" oder "sehr gut" beantwortet werden, hinzuzufügen

source: Total
de: Insgesamt

source: Answer Number
de: Antwortnummer

source: Answer Text
de: Antworttext

source: Comment Reviewee
de: Kommentar Geprüfte*r

source: Comment Reviewer
de: Kommentar Prüfer*in

source: Comment Peers
de: Kommentar Kolleg*in

source: Absence for {employee}
de: Abwesenheit für {employee}

source: Absence Requests for {employee}
de: Abwesenheitsanträge für {employee}

source: Absence Request for {employee}
de: Abwesenheitsantrag für {employee}

source: Weekly Presence Table
de: Wöchentliche Anwesenheitstabelle

source: Employee: {{_profile.first_name}} {{_profile.last_name}}
de: Angestellte*r: {{_profile.first_name}} {{_profile.last_name}}

source: Evaluations Graph of KPI: {kpi}
de: Evaluationsgraph für KPI: {kpi}

source: Review Templates
de: Bewertungsvorlagen

source: Review Group: {review_group}
de: Bewertungsgruppe: {review_group}

source: Review Question Category: {category}
de: Bewertungsfragenkategorie: {category}

source: Review: {review}
de: Bewertung: {review}

source: Progress of the review : {review}
de: Fortschritt der Bewertung: {review}

source: Progress of the review
de: Fortschritt der Bewertung

source: Evaluation of the review : {review}
de: Evaluation der Bewertung: {review}

source: Evaluation of the review
de: Evaluation der Bewertung

source: Progress of Reviews
de: Fortschritt der Bewertungen
