Repository: pypi-data/pypi-mirror-386
Catalog: packages/wbhuman_resources/wbhuman_resources-1.56.5-py2.py3-none-any.whl/wbhuman_resources/locale/*/LC_MESSAGES/django.po
Languages: de

source: Your CSV file has been imported : {} imported ({} added, {} updated), {} errors, {} revert errors found due to failure to restore old versions
de: Ihre CSV-Datei wurde importiert: {} importiert ({} hinzugefügt, {} aktualisiert), {} Fehler, {} Zurücksetzungsfehler durch Fehler beim Wiederherstellen alter Versionen gefunden

source: Notes
de: Anmerkungen

source: Default employee vacation days
de: Standard Urlaubstage für eine*n Angestellte*n

source: The number of vacation days allocated to an employee working full time
de: Die Anzahl an Urlaubstagen, die eine*m*r in Vollzeit Angestellten zugewiesen werden

source: Only positive natural numbers allowed.
de: Nur positive natürliche Zahlen erlaubt.

source: The number of days after which a vacation is considered a long vacation.
de: Die Anzahl an Tagen, nach denen ein Urlaub als ein langer Urlaub gezählt wird.

source: Long Vacation Number of days
de: Urlaubstage langer Urlaub

source: Accounting email destination
de: Mailadressen der Buchhaltung

source: The accounting company emails to send automatic reports to, as a comma separated list
de: Die Mailadressen der Buchhaltung, an die automatische Berichte gesendet werden, als kommaseparierte Liste

source: Package where the correct public holidays are found. Defaults to Europe Switzerland
de: Das Paket, in dem sich die korrekten öffentlichen Feiertage befinden. Standardeinstellung ist die Schweiz

source: The preference has to be in the format of <continent>.<region>
de: Muss im Format <Kontinent>.<Region> sein

source: Department
de: Abteilung

source: Is Employee Active
de: Ist Angestellte*r Aktiv

source: Type
de: Typ

source: Calendar
de: Kalendar

source: Week Day
de: Wochentag

source: Contract
de: Vertrag

source: Is Active
de: Ist Aktiv

source: Goal
de: Ziel

source: Related to
de: Verwandt Mit

source: Is Template
de: Ist Vorlage

source: Question
de: Frage

source: Deviation
de: Abweichung

source: Equal
de: Gleich

source: Less
de: Weniger

source: Greater
de: Mehr

source: Category
de: Kategorie

source: Participant's position
de: Position de*r Teilnehmer*in

source: Title
de: Titel

source: Vacation
de: Urlaub

source: If true, the days will be counted towards the employee's vacation balance
de: Falls ja, werden die Tage zu den Urlaubstagen der Angestellt*innen gezählt

source: Time-Off
de: Freizeit

source: If true, the employee is considered as not working
de: Falls ja, gilt der*die Angestellte als nicht arbeitend

source: Extensible
de: Verlängerbar

source: If true, allow the associated request to be extended
de: Falls ja, kann der zugehörige Antrag verlängert werden

source: Auto Approve
de: Automatisch Genehmigen

source: Days In Advance
de: Tage im Voraus

source: Absence Request Type
de: Abwesenheitsantragstyp

source: Absence Request Types
de: Abwesenheitsantragstypen

source: Draft
de: Entwurf

source: Pending
de: Ausstehend

source: Approved
de: Genehmigt

source: Denied
de: Abgelehnt

source: Cancelled
de: Widerrufen

source: The request status (defaults to draft)
de: Der Status des Antrags (standardmäßig Entwurf)

source: Employee
de: Angestellte*r

source: The employee requesting the absence
de: Der*Die Angestellte, der*die die Abwesenheit beantragt

source: Extra Notes
de: Zusätzliche Anmerkungen

source: A note to the HR administrator
de: Anmerkungen für den Personal-Administrator

source: Reason
de: Grund

source: The HR's response to this absence request
de: Die Antwort der Personalabteilung auf den Abwesenheitsantrag

source: Created
de: Erstellt

source: The request creation time
de: Die Erstellzeit des Antrages

source: Attachment
de: Anhang

source: Upload a file to document this absence request (e.g. medical certificate)
de: Laden Sie eine Datei als Unterlage (z.B. Attest) für diesen Antrag hoch

source: Submit
de: Absenden

source: Submitting
de: Absenden

source: <p>Are you sure you want to submit this request?</p>
de: <p>Sind Sie sich sicher, dass Sie diesen Antrag einreichen wollen?</p>

source: </br><p><b>Employee's Note:</b></p><i>{notes}</i>
de: </br><p><b>Anmerkungen des*der Angestellten:</b></p><i>{notes}</i>

source: New {type} Request
de: Neuer Antrag vom Typ {type}

source: Approve
de: Genehmigen

source: Approval
de: Genehmigung

source: <p>Are you sure you want to approve this request?</p>
de: <p>Sind Sie sich sicher, dass Sie diesen Antrag genehmigen wollen?</p>

source: Deny
de: Ablehnen

source: Denial
de: Ablehnung

source: <p>Are you sure you want to deny this request?</p>
de: <p>Sind Sie sich sicher, dass Sie diesen Antrag ablehnen wollen?</p>

source: </br><p><b>HR's reason:</b></p><i>{reason}</i>
de: </br><p><b>Grund:</b></p><i>{reason}</i>

source: Back to Draft
de: Zurück zu Entwurf

source: <p>Are you sure you want to put this request back to draft?</p>
de: <p>Sind Sie sich sicher, dass Sie diesen Antrag zurück zu den Entwürfen packen wollen?</p>

# Transition button
source: Cancel
de: Widerrufen

source: Cancellation
de: Widerrufen

source: <p>Are you sure you want to cancel this request?</p>
de: <p>Sind Sie sich sicher, dass Sie diesen Antrag widerrufen wollen?</p>

source: {employee} has cancelled a {type} request from {start_date} to {end_date}.
de: {employee} hat einen Antrag vom Typ {type} vom {start_date} bis {end_date} widerrufen.

source: Cancelled {type} Request
de: Widerrufener Antrag vom Typ {type}

source: Absence Request
de: Abwesenheitsantrag

source: Absence Requests
de: Abwesenheitsanträge

source: Request
de: Antrag

source: The associated request
de: Der zugehörige Antrag

source: Period
de: Zeitrahmen

source: Used to fetch the days off from an API.
de: Wird benutzt, um die freien Tage von einer API abzurufen.

source: The continent you've supplied is invalid.
de: Der Kontinent, den Sie angegeben haben, ist invalide.

source: The region you've supplied is invalid.
de: Die Region, die Sie angegeben haben, ist invalide.

source: Day Off Calendar
de: Freie Tage Kalendar

source: Days Off Calendar
de: Freie Tage Kalendar

source: Date
de: Datum

source: Count as Holiday
de: Als Feiertag Zählen

source: If true, there is no work but the day counts towards the employees' vacation balance
de: Falls ja, findet an dem Tag keine Arbeit statt, aber der Tag zählt trotzdem zum Urlaubsguthaben der Angestellt*innen

source: Day Off
de: Freier Tag

source: Days Off
de: Freie Tage

source: Internal
de: Intern

source: External
de: Extern

source: Monthly
de: Monatlich

source: Yearly
de: Jährlich

source: The CRM profile related to this employee
de: Das zugehörige CRM-Profil zu diese*m*r Angestellten

source: Is active
de: Ist Aktiv

source: If false, the employee will be considered as not active but his absence requests will be preserved
de: Falls nein, gilt der*die Angestellte als nicht aktiv, aber seine*ihre Abwesenheitsanträge werden nicht gelöscht

source: Extra Days Frequency
de: Frequenz Zusatztage

source: The frequency at which an additional number of vacation days is enabled for this employee (defaults to yearly)
de: Die Frequenz, bei der eine Anzahl an zusätzlichen Urlaubstagen für diese*n Angestellte*n aktiviert werden (standardmäßig jährlich)

source: Occupation Rate
de: Beschäftigungsrate

source: The occupation rate in percent, 100% being employed fulltime
de: Die Beschäftigungsrate in Prozent, 100% für eine Vollzeitanstellung

source: Employee Type
de: Angestellt*innentyp

source: If Internal, the employee is considered a full-time employee and thus has employee access to the system.
de: Falls intern, gilt der*die Angestellte als Vollzeitangestellte*r und hat deswegen Angestelltenzugang zum System.

source: The position this employee belongs to
de: Die Position, zu der diese*r Angestellte gehört

source: Enrolled at
de: Registriert Am

source: Employee Human Resource
de: Mitarbeiter*in Personalabteilung

source: Employee Human Resources
de: Mitarbeiter*innen Personalabteilung

source: The employee having that year balance
de: Der*Die Angestellte mit dem Jahresguthaben

source: Year
de: Jahr

source: Employee Year Balance
de: Jahresguthaben Angestellt*innen

source: Employee Year Balances
de: Jahresguthaben Angestellt*innen

source: Parent Positions
de: Elternpositionen

source: Department Manager
de: Abteilungsleiter*in

source: Positions
de: Positionen

source: {employee} deactivation ended and was successful
de: {employee} Deaktivierung abgeschlossen und erfolgreich

source: The following actions have been done: {messages}
de: Die folgenden Aktionen wurden durchgeführt: {messages}

source: Daily
de: Täglich

source: Weekly
de: Wöchentlich

source: Quarterly
de: Quartalsweise

source: Evaluated Persons
de: Evaluationspersonen

source: Evaluated Intervals
de: Evaluationsintervalle

source: Last update
de: Letzte Änderung

source: Date of latest change (automatically computed)
de: Datum der letzten Änderung (automatisch ausgefüllt)

source: Individual Evaluation
de: Individuelle Evaluation

source: Key Performance Indicator
de: Leistungsindikator (KPI)

source: Key Performance Indicators
de: Leistungsindikatoren (KPIs)

source: Evaluation
de: Auswertung

source: Evaluations
de: Auswertungen

source: Review Group
de: Bewertungsgruppe

source: Review Groups
de: Bewertungsgruppen

source: Stage 1: Preparation of review
de: Abschnitt 1: Vorbereitung der Bewertung

source: Stage 2: Fill in review
de: Abschnitt 2: Ausfüllen des Bewertungsformulars

source: Stage 3: Review
de: Abschnitt 3: Bewertung

source: Stage 4: Evalutation
de: Abschnitt 4: Evaluation

source: Stage 5: Validation
de: Abschnitt 5: Validierung

source: Annual
de: Jährlich

source: Intermediary
de: Unregelmäßig

source: Review
de: Bewertung

source: Reviews
de: Bewertungen

source: From
de: Von

source: To
de: Bis

source: Deadline
de: Frist

source: Auto Apply Deadline
de: Automatisch Frist Anwenden

source: Indicates one of the four stages defined by the workflow
de: Gibt eine der vier im Arbeitsablauf definierten Abschnitte an

source: Reviewee
de: Geprüfte*r

source: Reviewer
de: Prüfer*in

source: Group
de: Gruppe

source: Feedback Reviewee
de: Feedback Geprüfter*in

source: Feedback Reviewer
de: Feedback Prüfer*in

source: Date of reviewee's signature
de: Datum der Unterschrift de*s*r Geprüften

source: Date of reviewer's signature
de: Datum der Unterschrift de*s*r Prüfer*in

source: Completely Filled Out Reviewee
de: Komplett von Geprüfte*m*r Ausgefüllt

source: Completely Filled Out Reviewer
de: Komplett von Prüfer*in Ausgefüllt

source: {group} [Template]
de: {group} [Vorlage]

source: [Template]
de: [Vorlage]

source: {reviewee}'s Review
de: {reviewee}s Bewertung

source: <p>Status: <b>Stage 1: Preparation of review</b></p> <p>Reviewee: <b>{{_reviewee.computed_str}}</b></p> <p>Reviewer: <b>{{_reviewer.computed_str}}</b></p> <p>From: <b>{{from_date}}</b></p> <p>To: <b>{{to_date}}</b></p> <p>Deadline: <b>{{review_deadline}}</b></p> <p>Do you want to submit this review to <b>Stage 2: Fill in review?</b></p>
de: <p>Status: <b>Abschnitt 1: Vorbereitung der Bewertung</b></p> <p>Geprüfte*r: <b>{{_reviewee.computed_str}}</b></p> <p>Prüfer*in: <b>{{_reviewer.computed_str}}</b></p> <p>Von: <b>{{from_date}}</b></p> <p>Bis: <b>{{to_date}}</b></p> <p>Frist: <b>{{review_deadline}}</b></p> <p>Möchten Sie diese Bewertung zu <b>Abschnitt 2: Ausfüllen des Bewertungsformulars</b> einreichen?</p>

source: Finalize
de: Finalisieren

source: <p>Status: <b>Stage 2: Fill in review</b></p> <p>Reviewee: <b>{{_reviewee.computed_str}}</b></p> <p>Reviewer: <b>{{_reviewer.computed_str}}</b></p> <p>From: <b>{{from_date}}</b></p> <p>To: <b>{{to_date}}</b></p> <p>Deadline: <b>{{review_deadline}}</b></p> <p>Do you want to send this review to <b>Stage 3: Review?</b></p>
de: <p>Status: <b>Abschnitt 2: Ausfüllen des Bewertungsformulars</b></p> <p>Geprüfte*r: <b>{{_reviewee.computed_str}}</b></p> <p>Prüfer*in: <b>{{_reviewer.computed_str}}</b></p> <p>Von: <b>{{from_date}}</b></p> <p>Bis: <b>{{to_date}}</b></p> <p>Frist: <b>{{review_deadline}}</b></p> <p>Möchten Sie diese Bewertung zu <b>Abschnitt 3: Bewertung</b> einreichen?</p>

source: Stage 3: Review - {self}
de: Abschnitt 3: Bewertung - {self}

source: {self} has moved to stage 3: Review. You can now organize the evaluation
de: {self} ist bei Abschnitt 3: Bewertung angelangt. Sie können nun die Evaluation organisieren

source: Undo
de: Rückgängig Machen

source: <p>Status: <b>Stage 3: Review</b></p> <p>Reviewee: <b>{{_reviewee.computed_str}}</b></p> <p>Reviewer: <b>{{_reviewer.computed_str}}</b></p> <p>From: <b>{{from_date}}</b></p> <p>To: <b>{{to_date}}</b></p> <p>Deadline: <b>{{review_deadline}}</b></p> <p>Do you want to send this review to <b>Stage 2: Fill in review?</b></p>
de: <p>Status: <b>Abschnitt 3: Bewertung</b></p> <p>Geprüfte*r: <b>{{_reviewee.computed_str}}</b></p> <p>Prüfer*in: <b>{{_reviewer.computed_str}}</b></p> <p>Von: <b>{{from_date}}</b></p> <p>Bis: <b>{{to_date}}</b></p> <p>Frist: <b>{{review_deadline}}</b></p> <p>Möchten Sie diese Bewertung zu <b>Abschnitt 2: Ausfüllen des Bewertungsformulars</b> einreichen?</p>

source: Evaluate
de: Evaluieren

source: Stage 4: Evaluation
de: Abschnitt 4: Evaluation

source: <p>Status: <b>Stage 3: Review</b></p> <p>Reviewee: <b>{{_reviewee.computed_str}}</b></p> <p>Reviewer: <b>{{_reviewer.computed_str}}</b></p> <p>From: <b>{{from_date}}</b></p> <p>To: <b>{{to_date}}</b></p> <p>Deadline: <b>{{review_deadline}}</b></p> <p>Do you want to send this review to <b>Stage 4: Evaluation?</b></p>
de: <p>Status: <b>Abschnitt 3: Bewertung</b></p> <p>Geprüfte*r: <b>{{_reviewee.computed_str}}</b></p> <p>Prüfer*in: <b>{{_reviewer.computed_str}}</b></p> <p>Von: <b>{{from_date}}</b></p> <p>Bis: <b>{{to_date}}</b></p> <p>Frist: <b>{{review_deadline}}</b></p> <p>Wollen Sie diese Bewertung zu <b>Abschnitt 4: Evaluation</b> einreichen?</p>

source: Validate
de: Validieren

source: <p>Status: <b>Stage 4: Evaluation</b></p> <p>Reviewee: <b>{{_reviewee.computed_str}}</b></p> <p>Reviewer: <b>{{_reviewer.computed_str}}</b></p> <p>From: <b>{{from_date}}</b></p> <p>To: <b>{{to_date}}</b></p> <p>Do you want to send this review to <b>Stage 5: Validation?</b></p>
de: <p>Status: <b>Abschnitt 4: Evaluation</b></p> <p>Geprüfte*r: <b>{{_reviewee.computed_str}}</b></p> <p>Prüfer*in: <b>{{_reviewer.computed_str}}</b></p> <p>Von: <b>{{from_date}}</b></p> <p>Bis: <b>{{to_date}}</b></p> <p>Möchten Sie diese Bewertung zu <b>Abschnitt 5: Validierung</b> einreichen?</p>

source: <p>Please pay particular attention to the deadline <b>{deadline}</b>, the review will automatically move to step 3 of the workflow on that date. At this stage the data will be frozen, you will not be able to modify it.</p>
de: <p>Bitte achten Sie besonders auf die Frist <b>{deadline}</b>, die Bewertung wird an diesem Tag automatisch zu Abschnitt 3 des Arbeitsablaufes übergehen. An diesem Punkt können die Daten nicht mehr verändert werden.</p>

source: Weight
de: Gewichtung

source: Review Question Category
de: Fragenkategorie der Bewertung

source: Review Question Categories
de: Fragenkategorien der Bewertung

source: Rating
de: Punkte

source: Mandatory
de: Benötigt

source: For Reviewee
de: Für Geprüfte*n

source: For Reviewer
de: Für Prüfer*in

source: For Department Peers
de: Für Abteilungskolleg*innen

source: For Company Peers
de: Für Firmenkolleg*innen

source: Review Question
de: Bewertungsfrage

source: Review Questions
de: Bewertungsfragen

source: Review Answer
de: Bewertungsantwort

source: Review Answers
de: Bewertungsantworten

source: Answered By
de: Beantwortet Von

source: Answered Anonymized
de: Anonymisiert Geantwortet

source: Comment
de: Kommentar

source: The KPI '{kpi_name}' is evaluated {interval} over the period from {lower_period} to {upper_period}. {person_name}'s evaluation as of {evaluation_date} was {evaluated_score} for a goal of {goal}. That is an accomplished percentage of {percentage}%. What do you think of this result?
de: Der KPI '{kpi_name}' wird {interval} über einen Zeitraum von {lower_period} bis {upper_period} evaluiert. {person_name}'s Evaluation vom {evaluation_date} lag bei {evaluated_score} für ein Ziel von {goal}. Das ist ein erreichter Prozentsatz von {percentage}%. Was halten Sie von diesem Ergebnis?

source: Dear {first_name} {last_name}, <p>your review is ready. You can fill it in until {deadline}.</p>
de: Sehr geehrte*r {first_name} {last_name}, <p>Ihre Bewertung ist fertig. Sie können diese bis zum {deadline} ausfüllen.</p>

source: Dear {first_name} {last_name}, <p>you are the reviewer of the review: {review}. You can fill in the questions related to you until <b>{deadline}.</b></p>
de: Sehr geehrte*r {first_name} {last_name}, <p>Sie sind der*die Prüfer*in der Bewertung: {review}. Sie können die Fragen für Sie bis zum <b>{deadline}</b> beantworten.</p>

source: Dear {first_name} {last_name}, <p>you are a peer of the review: {review}. You can fill in the questions related to you until <b>{deadline}.</b></p>
de: Sehr geehrte*r {first_name} {last_name}, <p>Sie sind ein*e Kolleg*in für die Bewertung: {review}. Sie können die Fragen für Sie bis zum<b>{deadline}</b> beantworten.</p>

source: Stage 2: Fill in review - {review}
de: Abschnitt 2: Ausfüllen des Bewertungsformulars - {review}

source: Review PDF -
de: PDF Auswerten -

source: Total Days
de: Gesamttage

source: The total number of days this request spans (i.e. only actual working days)
de: Die gesamte Anzahl an Tagen, die dieser Antrag umfasst (d.h. nur eigentliche Arbeitstage)

source: Vacation Days
de: Urlaubstage

source: The number of vacation days this request uses
de: Die Anzahl an Urlaubstagen, die dieser Antrag verbraucht

source: End date cannot be before start date
de: Enddatum darf nicht vor Startdatum sein

source: The request needs to start at least {days_in_advance} days from now
de: Der Antrag muss mindestens in {days_in_advance} Tagen starten

source: Increase absence by
de: Abwesenheit Verlängern Um

source: Long Vacation
de: Langer Urlaub

source: True if the user took at least one long vacation in a row
de: Ja, falls der Nutzer mindestens einen langen Urlaub genommen hat

source: Extra days per period
de: Zusatztage für Zeitraum

source: Primary Email
de: Primäre E-Mail-Adresse

source: Primary Address
de: Primäre Adresse

source: Primary Telephone
de: Primäre Telefonnummer

source: Substitution Person
de: Vertretende Person

source: Handler
de: Anwender

source: Only the rating questions you answered are taken into account
de: Nur die Fragen mit Punktwertung werden berücksichtigt

source: The field has to be empty if is_template is True
de: Dieses Feld muss leer sein wenn is_template wahr ist

source: Review For
de: Bewertung Für

source: Both 'For department peers' and 'For company peers' true does not make any sense. Only 1 can be active
de: Sowohl 'Für Kolleg*innen der Abteilung' und 'Für Kolleg*innen des Unternehmens' ergibt keinen Sinn. Nur einer kann aktiv sein

source: Comment cannot be empty, a response to this question is mandatory
de: Kommentar darf nicht leer sein, eine Antwort auf diese Frage wird benötigt

source: Rating cannot be empty, a response to this question is mandatory
de: Punktwertung darf nicht leer sein, eine Antwort auf diese Frage wird benötigt

source: {} {}'s birthday is {}!
de: {} {}s Geburtstag ist der {}!

source: Wish her/him a happy birthday!
de: Wünschen Sie ihm/ihr alles Gute!

source: Please find the vacation days balance valid to the end of the month as attached excel file
de: Sie finden das Guthaben für die Urlaubstage bis zum Ende des Monats in der angehängte Excel-Datei

source: Vacation balance summary at {:%d.%m.%Y}
de: Zusammenfassung Urlaubsguthaben am {:%d.%m.%Y}

source: Vacation Report {:%d.%m.%Y}
de: Urlaubsbericht {:%d.%m.%Y}

source: Dear {} {}, <p>you only have one more week to complete the review.</p>
de: Sehr geehrte*r {} {}, <p>Sie haben nur noch eine Woche um die Bewertung abzuschließen.</p>

source: Stage 2: Fill in review - {}
de: Abschnitt 2: Ausfüllen des Bewertungsbogens - {}

source: Dear {} {}, <p>you only have one more day to complete the review.</p>
de: Sehr geehrte*r {} {}, <p>Sie haben nur noch einen Tag um die Bewertung abzuschließen.</p>

source: Atonrâ Website
de: Atonrâ Webseite

source: Evaluation Form
de: Evaluationsformular

source: Period covered
de: Abgedeckter Zeitrahmen

source: Notification date review completed
de: Benachrichtigungsdatum abgeschlossene Bewertung

source: Date of signature
de: Datum der Unterschrift

source: Review of questions to be answered on a scale of 1 to 4
de: Auswertung der Fragen auf einer Skala von 1 bis 4

source: Questions & Comments
de: Fragen & Kommentare

source: Global rating (weighted)
de: Globale Bewertung (gewichtet)

source: Current Day
de: Heutiger Tag

source: Current Week
de: Aktuelle Woche

source: Current Month
de: Aktueller Monat

source: Current Year
de: Laufendes Jahr

source: All
de: Alle

source: Monday
de: Montag

source: Tuesday
de: Dienstag

source: Wednesday
de: Mittwoch

source: Thursday
de: Donnerstag

source: Friday
de: Freitag

source: Saturday
de: Samstag

source: Sunday
de: Sonntag

source: Increasing Days
de: Tage Hinzufügen

source: Increase Days
de: Tage Hinzufügen

source: <p>You are about to increase the abscence request by {{number_days}} days</p>
de: <p>Sie sind dabei, den Abwesenheitsantrag um {{number_days}} Tage zu erweitern</p>

source: Deactivating Employee
de: Deaktivierung des*der Angestellten

source: Deactivate Employee
de: Angestellte*n Deaktivieren

source: Evaluation Graph
de: Evaluationsgraph

source: Latest Evaluations
de: Letzte Evaluationen

source: Progress
de: Fortschritt

source: Sending Review
de: Absenden der Bewertung

source: Finish and Send Review
de: Beenden und Bewertung Abschicken

source: <p>Have you finished filling in the review? </p> <p><span style='color:red'>This action is not reversible</span></p>
de: <p>Haben Sie ihre Bewertung zuende ausgefüllt? </p> <p><span style='color:red'>Diese Aktion ist nicht umkehrbar</span></p>

source: Confirm
de: Bestätigen

# Non-Transition button
source: Cancel
de: Abbrechen

source: Signing
de: Unterschreiben

source: Sign
de: Unterschreiben

source: <p>Do you want to sign the review? </p> <p><span style='color:red'>This action is not reversible</span></p>
de: <p>Wollen Sie diese Bewertung unterschreiben? </p> <p><span style='color:red'>Diese Aktion ist nicht umkehrbar</span></p>

source: Sending Report
de: Bericht Absenden

source: Generate and Send Report
de: Bericht Generieren und Abschicken

source: Employees
de: Angestellt*innen

source: Include KPI
de: KPI Einfügen

source: Generating Review
de: Bewertungsformular Erzeugen

source: Generate Review from Template
de: Bewertung aus Vorlage Generieren

source: Generate Review
de: Bewertungsformular Erzeugen

source: <p>Generate report from : <p> <b><span>{{computed_str}} </span></b> </p>
de: <p>Einen Bericht generieren von : <p> <b><span>{{computed_str}} </span></b> </p>

source: Number of reviews found
de: Anzahl an gefundenen Bewertungen

source: Submitting Reviews from Stage 1 to Stage 2
de: Einsenden der Bewertungen von Abschnitt 1 zu Abschnitt 2

source: Submit Reviews from Stage 1 to Stage 2
de: Bewertungen von Abschnitt 1 zu Abschnitt 2 Einsenden

source: Submit Reviews
de: Bewertungen Absenden
