Repository: pypi-data/pypi-mirror-386
Catalog: packages/django-dynamic-workflows/django_dynamic_workflows-1.3.1-py3-none-any.whl/django_workflow_engine/locale/*/LC_MESSAGES/django.po
Languages: ar

source: Self Approved
ar: موافقة ذاتية

source: Role
ar: دور

source: User
ar: مستخدم

source: Team Head
ar: رئيس الفريق

source: Department Head
ar: رئيس القسم

source: Role-based Approval
ar: موافقة على أساس الدور

source: User-specific Approval
ar: موافقة مستخدم محدد

source: Self Approval
ar: موافقة ذاتية

source: Team Head Approval
ar: موافقة رئيس الفريق

source: Department Head Approval
ar: موافقة رئيس القسم

source: Any user with role can approve
ar: أي مستخدم لديه الدور يمكنه الموافقة

source: All users with role must approve
ar: يجب على جميع المستخدمين ذوي الدور الموافقة

source: Rotate approval among role users
ar: تناوب الموافقة بين مستخدمي الدور

source: No workflow attached to {obj_label}({obj_pk}). Use attach_workflow_to_object() to attach a workflow first.
ar: لا يوجد تدفق عمل مرفق بـ {obj_label}({obj_pk}). استخدم attach_workflow_to_object() لإرفاق تدفق عمل أولاً.

source: Workflow is not in progress (status: {status}). Current status must be 'in_progress' to perform this action.
ar: تدفق العمل ليس قيد التنفيذ (الحالة: {status}). يجب أن تكون الحالة الحالية 'قيد التنفيذ' لتنفيذ هذا الإجراء.

source: Workflow '{workflow_name}' has no pipelines. Add at least one pipeline with stages to use this workflow.
ar: تدفق العمل '{workflow_name}' لا يحتوي على خطوط أنابيب. أضف خط أنابيب واحد على الأقل مع مراحل لاستخدام تدفق العمل هذا.

source: Pipeline '{pipeline_name}' has no stages. Add at least one stage with approvals to use this pipeline.
ar: خط الأنابيب '{pipeline_name}' لا يحتوي على مراحل. أضف مرحلة واحدة على الأقل مع الموافقات لاستخدام خط الأنابيب هذا.

source: No next stage found, completing workflow for {obj_label}({obj_pk})
ar: لم يتم العثور على المرحلة التالية، جار إتمام تدفق العمل لـ {obj_label}({obj_pk})

source: No current pipeline found for attachment {attachment_id}, cannot determine next stage
ar: لم يتم العثور على خط أنابيب حالي للمرفق {attachment_id}، لا يمكن تحديد المرحلة التالية

source: No user found for building approval steps for {obj_label}({obj_pk}), this may cause issues with approval flow
ar: لم يتم العثور على مستخدم لبناء خطوات الموافقة لـ {obj_label}({obj_pk})، قد يتسبب هذا في مشاكل مع تدفق الموافقة

source: Workflow already started (status: {status}). Cannot start a workflow that is already in progress.
ar: تدفق العمل بدأ بالفعل (الحالة: {status}). لا يمكن بدء تدفق عمل قيد التنفيذ بالفعل.

source: Workflow '{workflow_name}' is not active and cannot be attached. Please activate the workflow before attaching it to objects.
ar: تدفق العمل '{workflow_name}' غير نشط ولا يمكن إرفاقه. يرجى تنشيط تدفق العمل قبل إرفاقه بالكائنات.

source: Workflow created - ID: {workflow_id}, Name: {name}, Pipelines: {pipeline_count}
ar: تم إنشاء تدفق العمل - المعرف: {workflow_id}، الاسم: {name}، خطوط الأنابيب: {pipeline_count}

source: Pipeline created - ID: {pipeline_id}, Workflow: {workflow_name}, Stages: {stage_count}
ar: تم إنشاء خط الأنابيب - المعرف: {pipeline_id}، تدفق العمل: {workflow_name}، المراحل: {stage_count}

source: Workflow started for {obj_label}({obj_pk}) at stage '{stage_name}'
ar: بدأ تدفق العمل لـ {obj_label}({obj_pk}) في المرحلة '{stage_name}'

source: Workflow completed for {obj_label}({obj_pk})
ar: اكتمل تدفق العمل لـ {obj_label}({obj_pk})

source: Moved {obj_label}({obj_pk}) from stage '{from_stage}' to '{to_stage}'
ar: تم نقل {obj_label}({obj_pk}) من المرحلة '{from_stage}' إلى '{to_stage}'

source: Pipeline changed from '{from_pipeline}' to '{to_pipeline}'
ar: تم تغيير خط الأنابيب من '{from_pipeline}' إلى '{to_pipeline}'

source: Starting approval flow for stage '{stage_name}' with {step_count} steps
ar: بدء تدفق الموافقة للمرحلة '{stage_name}' بـ {step_count} خطوات

source: No approval steps generated for stage '{stage_name}', workflow may be stuck
ar: لم يتم إنشاء خطوات موافقة للمرحلة '{stage_name}'، قد يكون تدفق العمل عالقاً

source: Company/Organization user that owns this workflow
ar: مستخدم الشركة/المنظمة التي تملك تدفق العمل هذا

source: English name
ar: الاسم بالإنجليزية

source: Arabic name
ar: الاسم بالعربية

source: The original object this was cloned from
ar: الكائن الأصلي الذي تم استنساخ هذا منه

source: Cloned From
ar: مستنسخ من

source: Status of the workflow
ar: حالة تدفق العمل

source: Status
ar: الحالة

source: Workflow description
ar: وصف تدفق العمل

source: Description
ar: الوصف

source: Whether this workflow is active and can be used
ar: ما إذا كان تدفق العمل هذا نشطاً ويمكن استخدامه

source: Is Active
ar: نشط

source: Whether this workflow is hidden (true for cloned workflows)
ar: ما إذا كان تدفق العمل هذا مخفياً (صحيح لتدفقات العمل المستنسخة)

source: Is Hidden
ar: مخفي

source: Workflow
ar: تدفق العمل

source: Workflows
ar: تدفقات العمل

source: Content type of the department model
ar: نوع محتوى نموذج القسم

source: ID of the department object
ar: معرف كائن القسم

source: Order of this pipeline in the workflow
ar: ترتيب خط الأنابيب هذا في تدفق العمل

source: Whether this pipeline is hidden (true for cloned pipelines)
ar: ما إذا كان خط الأنابيب هذا مخفياً (صحيح لخطوط الأنابيب المستنسخة)

source: Form configuration for this stage
ar: تكوين النموذج لهذه المرحلة

source: Stage configuration including approvals
ar: تكوين المرحلة بما في ذلك الموافقات

source: Order of this stage in the pipeline
ar: ترتيب هذه المرحلة في خط الأنابيب

source: Whether this stage is hidden (true for cloned stages)
ar: ما إذا كانت هذه المرحلة مخفية (صحيح للمراحل المستنسخة)

source: The model type this workflow is attached to
ar: نوع النموذج المرفق به تدفق العمل هذا

source: The ID of the model instance
ar: معرف مثيل النموذج

source: Current stage in the workflow progression
ar: المرحلة الحالية في تقدم تدفق العمل

source: Current pipeline in the workflow progression
ar: خط الأنابيب الحالي في تقدم تدفق العمل

source: Current status of workflow execution
ar: الحالة الحالية لتنفيذ تدفق العمل

source: Additional metadata for workflow execution
ar: بيانات تعريف إضافية لتنفيذ تدفق العمل

source: Reason is required for rejection
ar: السبب مطلوب للرفض

source: Reason is required for resubmission
ar: السبب مطلوب لإعادة التقديم

source: Stage does not belong to current workflow
ar: المرحلة لا تنتمي إلى سير العمل الحالي

source: Invalid stage ID
ar: معرف المرحلة غير صالح

source: Invalid user ID
ar: معرف المستخدم غير صالح

source: Form data is required for this approval step
ar: بيانات النموذج مطلوبة لهذه خطوة الموافقة

source: Object instance is required for workflow approval
ar: مثيل الكائن مطلوب للموافقة على سير العمل

source: Failed to process approval action: {error}
ar: فشل في معالجة إجراء الموافقة: {error}
