Repository: pypi-data/pypi-mirror-386
Catalog: packages/ftw-django-features/ftw_django_features-2025.4.1.tar.gz/ftw_django_features-2025.4.1/django_features/locale/*/LC_MESSAGES/django.po
Languages: fr

source: Deutsch
fr: Allemand

source: Englisch
fr: Anglais

source: Französisch
fr: Français

source: Benutzerdefinierte Werte
fr: Valeurs personnalisées

source: Text (einzeilig)
fr: Texte (une ligne)

source: Text (mehrzeilig)
fr: Texte (plusieurs lignes)

source: Datum
fr: Date

source: Datum und Zeit
fr: Date et heure

source: Zahl (Ganzzahl)
fr: Nombre (nombre entier)

source: Checkbox
fr: Case à cocher

source: Leeren String erlauben
fr: Autoriser les chaînes vides

source: Leere Werte erlauben
fr: Autoriser les valeurs vides

source: Auswahlfeld
fr: Champ de sélection

source: Standardwert
fr: Valeur par défaut

source: Editierbar
fr: Modifiable

source: Externer Key
fr: Clé externe

source: Feldtyp
fr: Type de champ

source: Ausblenden
fr: Masquer

source: Name
fr: Nom

source: Mehrfachauswahlfeld
fr: Champ à choix multiples

source: Reihenfolge
fr: Ordre

source: Erforderlich
fr: Nécessaire

source: Benutzerdefiniertes Feld
fr: Champ personnalisé

source: Benutzerdefinierte Felder
fr: Champs personnalisés

source: Feld
fr: Champ

source: Wert
fr: Valeur

source: Benutzerdefinierter Wert
fr: Valeur personnalisée

source: Icon
fr: Icône

source: Icon Name von mdi ohne mdi-Prefix mit Bindestrich getrennt
fr: Nom de l'icône mdi sans préfixe mdi, séparé par un tiret

source: Systemmeldungstyp
fr: Type de message système

source: Systemmeldungstypen
fr: Types de message système

source: Hintergrundfarbe
fr: Couleur de fond

source: Beginn
fr: Début

source: Ende
fr: Fin

source: Nachricht
fr: Message

source: Textfarbe
fr: Couleur du texte

source: Titel
fr: Titre

source: Typ
fr: Type

source: Systemmeldung
fr: Message système

source: Systemmeldungen
fr: Messages système
