Repository: pypi-data/pypi-mirror-386
Catalog: packages/otree/otree-6.0.0b22.tar.gz/otree-6.0.0b22/otree/locale/*/LC_MESSAGES/django.po
Languages: ar, cs, fi, fr, he, hu, nb, nl, ru

source: Participant {id_in_group}
ar: المشارك {id_in_group}
cs: Účastník {id_in_group}
fi: Osallistuja {id_in_group}
he: {id_in_group} משתתף
hu: {id_in_group}. résztvevő
nb: Deltaker {id_in_group}
nl: Deelnemer {id_in_group}
ru: Участник {id_in_group}

source: {nickname} (Me)
ar: {nickname} (أنا)
cs: {nickname} (Já)
fi: {nickname} (Minä)
fr: {nickname} (Moi)
he: (אני) {nickname}
hu: {nickname} (Én)
nb: {nickname} (Meg)
nl: {nickname} (ik)
ru: {nickname} (я)

source: This field is required.
ar: هذا الحقل إلزامي
cs: Toto pole je povinné.
fi: Tämä kenttä on pakollinen.
fr: Ce champ est nécessaire
he: זהו שדה חובה
hu: Ezt a mezőt kötelező kitölteni.
nb: Dette feltet må fylles ut.
nl: Dit veld is verplicht.
ru: Это поле обязательно для заполнения.

source: {} point
ar: {} نقطة
cs: {} bod
fi: {} piste
he: {} נקודה
hu: {} pont
nb: {} poeng
nl: {} punt
ru: {} очко

source: Yes
ar: نعم
cs: Ano
fi: Kyllä
fr: Oui
he: כן
hu: Igen
nb: Ja
nl: Ja
ru: Да

source: No
ar: لا
cs: Ne
fi: Ei
fr: Non
he: לא
hu: Nem
nb: Nei
nl: Nee
ru: Нет

source: '%(value)s' is not a valid choice for this field
ar: '%(value)s' ليس خياراً صالحاً لهذا الحقل
cs: '%(value)s' není platná volba pro toto pole
fi: '%(value)s' ei ole kelvollinen valinta tälle kentälle
fr: '%(value)s' n'est pas un choix valide pour ce champ
he: '%(value)s' אינה בחירה תקפה עבור שדה זה
hu: '%(value)s' nem érvényes választás ehhez a mezőhöz
nb: '%(value)s' er ikke et gyldig valg for dette feltet
nl: '%(value)s' is geen geldige keuze voor dit veld
ru: '%(value)s' не является допустимым выбором для этого поля

source: points
ar: نقاط
cs: bodů
fi: pistettä
he: נקודות
hu: pontok
nb: poeng
nl: punten
ru: очков

source: Paused
ar: متوقف مؤقتاً
cs: Pozastaveno
fi: Keskeytetty
fr: En pause
he: מושהה
hu: Szüneteltetve
nb: Pause
nl: Gepauzeerd
ru: Приостановлено

source: The button was not clicked within the requested time.
ar: لم يتم النقر على الزر خلال الوقت المطلوب.
cs: Tlačítko nebylo stisknuto v požadovaném čase.
fi: Painiketta ei painettu pyydetyssä ajassa.
fr: Le bouton n'a pas été cliqué dans le délai demandé.
he: הכפתור לא נלחץ בזמן המבוקש.
hu: A gombra nem kattintottak a megadott időn belül.
nb: Knappen ble ikke klikket innen den forespurte tiden.
nl: De knop werd niet aangeklikt binnen de gevraagde tijd.
ru: Кнопка не была нажата в течение указанного времени.

source: To return to the wait page, click the button below.
ar: للعودة إلى صفحة الانتظار، انقر على الزر أدناه.
cs: Chcete-li se vrátit na čekací stránku, klikněte na tlačítko níže.
fi: Palataksesi odotussivulle, napsauta alla olevaa painiketta.
fr: Pour revenir à la page d'attente, cliquez sur le bouton ci-dessous.
he: כדי לחזור לעמוד ההמתנה, לחץ על הכפתור למטה.
hu: A várakozási oldalra való visszatéréshez kattintson az alábbi gombra.
nb: For å gå tilbake til ventesiden, klikk på knappen nedenfor.
nl: Om terug te keren naar de wachtpagina, klik op de knop hieronder.
ru: Чтобы вернуться на страницу ожидания, нажмите кнопку ниже.

source: Return to wait page
ar: العودة إلى صفحة الانتظار
cs: Návrat na čekací stránku
fi: Palaa odotussivulle
fr: Retour à la page d'attente
he: חזור לעמוד ההמתנה
hu: Vissza a várakozási oldalra
nb: Gå tilbake til ventesiden
nl: Terug naar wachtpagina
ru: Вернуться на страницу ожидания

source: Please fix the errors.
ar: الرجاء تصحيح الأخطاء في النموذج
cs: Opravte prosím chyby ve formuláři.
fi: Korjaa virheet.
fr: S'il vous plaît, veuillez corriger les erreurs.
he: נא לתקן את השגיאות
hu: Kérjük, javítsa ki az oldalon lévő hibákat.
nb: Vennligst rett feil i skjemaet.
nl: Corrigeer de fouten in het formulier.
ru: Пожалуйста внесите исправления в поля формы.

source: Welcome
ar: أهلا وسهلا
cs: Vítejte
fi: Tervetuloa
fr: Bienvenue
he: ברוכים הבאים
hu: Üdvözöljük
nb: Velkommen
nl: Welkom
ru: Добро пожаловать

source: This participant label was not found
ar: لم يتم العثور على معرف المشارك هذا
cs: Tento identifikátor účastníka nebyl nalezen
fi: Tätä osallistujatunnistetta ei löytynyt
fr: Label de participant introuvable
he: תווית משתתף חסרה
hu: Érvénytelen; próbája újra.
nb: Denne deltakeridentifikatoren ble ikke funnet
nl: Deelnemerslabel niet gevonden
ru: Метка участника не найдена

source: Participant label:
ar: معرف المشارك:
cs: Označení účastníka:
fi: Osallistujatunniste:
fr: Étiquette du participant :
he: תווית משתתף:
hu: Résztvevői címke:
nb: Deltakeretikett:
nl: Deelnemerslabel:
ru: Метка участника:

source: Click the button to start.
ar: انقر على الزر للبدء.
cs: Klikněte na tlačítko pro spuštění.
fi: Napsauta painiketta aloittaaksesi.
fr: Cliquez sur le bouton pour commencer.
he: לחץ על הכפתור כדי להתחיל.
hu: Kattintson a gombra a kezdéshez.
nb: Klikk på knappen for å starte.
nl: Klik op de knop om te beginnen.
ru: Нажмите кнопку, чтобы начать.

source: Start
ar: ابدأ
cs: Začít
fi: Aloita
fr: Commencer
he: התחל
hu: Kezdés
ru: Начать

source: Click the below button within ${secondsLeftSpan} seconds.
ar: انقر على الزر أدناه خلال ${secondsLeftSpan} ثانية.
cs: Klikněte na tlačítko níže do ${secondsLeftSpan} sekund.
fi: Napsauta alla olevaa painiketta ${secondsLeftSpan} sekunnin kuluessa.
fr: Cliquez sur le bouton ci-dessous dans ${secondsLeftSpan} secondes.
he: לחץ על הכפתור למטה תוך ${secondsLeftSpan} שניות.
hu: Kattintson az alábbi gombra ${secondsLeftSpan} másodpercen belül.
nb: Klikk på knappen nedenfor innen ${secondsLeftSpan} sekunder.
nl: Klik op de knop hieronder binnen ${secondsLeftSpan} seconden.
ru: Нажмите кнопку ниже в течение ${secondsLeftSpan} секунд.

source: Please confirm
ar: يرجى التأكيد
cs: Prosím potvrďte
fi: Vahvista
fr: Veuillez confirmer
he: אנא אשר
hu: Kérjük, erősítse meg
nb: Vennligst bekreft
nl: Bevestig alstublieft
ru: Пожалуйста, подтвердите

source: An error occurred.
ar: حدث خطأ ما‫.‬ الرجاء التأكد من المدخلات أو قم بسؤال المشرف للمساعدة‫.
cs: Vyskytla se chyba. Prosím, zkontrolujte logy nebo požádejte administrátora o pomoc.
fi: Tapahtui virhe.
fr: Une erreur s'est produite
he: יש שגיאה
hu: Hiba történt. Kérjük, ellenőrizze a log-fájlokat vagy forduljon az adminisztrátorhoz segítségért.
nb: En feil inntraff
nl: Er is een fout opgetreden. Controleer het logboek of vraag de beheerder om hulp.
ru: Произошла ошибка

source: Are you still there?
ar: هل ما زلت هنا؟
cs: Jste stále zde?
fi: Oletko vielä paikalla?
fr: Êtes-vous toujours là ?
he: האם אתה עדיין כאן?
hu: Még mindig itt vagy?
nb: Er du fortsatt der?
nl: Bent u er nog?
ru: Вы все еще здесь?

source: I'm still active
ar: ما زلت نشطاً
cs: Stále jsem aktivní
fi: Olen edelleen aktiivinen
fr: Je suis toujours actif
he: אני עדיין פעיל
hu: Még mindig aktív vagyok
nb: Jeg er fortsatt aktiv
nl: Ik ben nog actief
ru: Я все еще активен

source: Send
ar: إرسال
cs: Odeslat
fi: Lähetä
fr: Envoyer
he: שלח
hu: Elküldés
nl: Verzenden
ru: Отправить

source: Next
ar: التالي
cs: Další
fi: Seuraava
fr: Suivant
he: הבא
hu: Tovább
nb: Neste
nl: Volgende
ru: Далее

source: Back
ar: رجوع
cs: Zpět
fi: Takaisin
fr: Retour
he: חזור
hu: Vissza
nb: Tilbake
nl: Terug
ru: Назад

source: Powered by {product_name}
ar: مشغل بواسطة {product_name}
cs: Běží na {product_name}
fi: Järjestelmää pyörittää {product_name}
fr: Généré par {product_name}
he: מופעל ע"י {product_name}
hu: Támogatja az {product_name}
nb: Drevet av {product_name}
nl: Aangeboden door {product_name}
ru: На базе {product_name}

source: Time left to complete this page:
ar: الوقت المتبقي لإكمال هذه الصفحة‫:
cs: Čas zbývající k dokončení stránky:
fi: Aikaa jäljellä tämän sivun täyttämiseen:
fr: Temps restant pour compléter cette page:
he: זמן נותר להשלמת העמוד
hu: Az oldal kitöltésére maradt idő:
nb: Tid igjen for å fullføre denne siden:
nl: Resterende tijd om deze pagina te voltooien:
ru: Для выполнения задания на этой странице у вас осталось:

source: Please wait
ar: الرجاء الانتظار
cs: Prosím čekejte
fi: Odota
fr: Veuillez patienter
he: נא להמתין
hu: Kérjük, várjon
nb: Vennligst vent
nl: Even geduld alstublieft
ru: Пожалуйста подождите

source: Waiting to form a group with other participants.
ar: في انتظار تشكيل مجموعة مع المشاركين الآخرين
cs: Čeká se na vytvoření skupiny s dalšími účastníky.
fi: Odotetaan ryhmän muodostumista muiden osallistujien kanssa.
fr: En attente de former un groupe avec d'autres participants.
he: ממתינים ליצירת קבוצה עם משתתפים אחרים
hu: Várakozás a csoport létrehozására más résztvevőkkel.
nb: Venter på å danne en gruppe med andre deltakere.
nl: Wachten om een groep te vormen met andere deelnemers.
ru: Ожидание формирования группы с другими участниками.

source: Waiting for the other participants.
ar: الرجاء الانتظار ريثما ينتهي الأخرون
cs: Čeká se na další účastníky.
fi: Odotetaan muita osallistujia.
fr: En attente des autres participants.
he: ממתינים לשאר המשתתפים
hu: Kérjük, várjon, amíg a többi résztvevő is készen áll.
nb: Venter på de andre deltagerne.
nl: Wachten op de overige deelnemers.
ru: Пожалуйста ожидайте других участников.

source: Waiting for the other participant.
ar: الرجاء الانتظار ريثما ينتهي المشارك الآخر
cs: Čeká se na druhého účastníka.
fi: Odotetaan toista osallistujaa.
fr: En attente de l'autre participant.
he: ממתינים למשתתף הנוסף
hu: Kérjük, várjon, amíg a többi résztvevő is készen áll.
nb: Venter på den andre deltageren.
nl: Wachten op de andere deelnemer.
ru: Пожалуйста ожидайте другого участника.

source: Session is full.
ar: الجلسة ممتلئة.
cs: Relace je plná.
fi: Istunto on täynnä.
fr: Session complète
he: הסשן מלא
hu: A munkamenet megtelt.
nb: Sesjonen er full.
nl: Sessie is vol
ru: Сессия заполнена

source: Waiting for your session to begin
ar: في انتظار بدء جلستك
cs: Čeká se na začátek vaší session.
fi: Odotetaan istunnon alkamista
fr: En attendant le début de votre session
he: ממתינים לתחילת הסשן
hu: Kérjük, várjon, amíg a kísérlete elkezdödik
nb: Venter på at sesjonen skal begynne
nl: Wachten tot je sessie begint
ru: Ожидание начала сессии
