Repository: pypi-data/pypi-mirror-386
Catalog: packages/djangocms-oidc-form-fields/djangocms_oidc_form_fields-4.1.0.tar.gz/djangocms_oidc_form_fields-4.1.0/djangocms_oidc_form_fields/locale/*/LC_MESSAGES/django.po
Languages: cs

source: Additional body text used when email notifications are active.
cs: Další část textu je použita, pokud je zatržen přepínač Další část textu e-mailu.

source: Additional email body
cs: Další část textu e-mailu

source: Form data:
cs: Data formuláře:

source: Form name: %(form_name)s
cs: Jméno formuláře: %(form_name)s

source: Handovered data
cs: Předané údaje

source: Handovered data:
cs: Předané údaje:

source: OIDC - Only send email with handovered data
cs: OIDC - Jen odeslat e-mail s předanými údaji

source: OIDC - Send email with handovered data and save to the site
cs: OIDC - Odeslat e-mail s předanými údaji a uložit na web

source: OIDC Email Field
cs: OIDC Pole e-mail

source: OIDC Email into From Field
cs: OIDC E-mail pro From

source: OIDC Form
cs: OIDC Formulář

source: OIDC Form submission
cs: OIDC Odeslaný formulář

source: OIDC Form submissions
cs: OIDC Odeslané formuláře

source: OIDC Hidden Field
cs: OIDC Skryté pole

source: OIDC Number Field
cs: OIDC Pole číslo

source: OIDC Phone Field
cs: OIDC Pole telefon

source: OIDC Text Area Field
cs: OIDC Víceřádkové textové pole

source: OIDC Text Field
cs: OIDC Textové pole

source: OIDC Yes/No Field
cs: OIDC Ano/Ne pole

source: OIDC attributes
cs: OIDC atributy

source: OIDC attributes handovered from provider (names separated by space).
cs: Seznam OIDC údajů předaných poskytovatelem (položky oddělené mezerou).

source: OpenID Connect Elements
cs: OpenID Connect Elementy

source: OpenID Connect Form
cs: OpenID Connect Formulář

source: OpenID Connect Form Field
cs: OpenID Connect Formulářové pole

source: The value of the field cannot be changed by the user.
cs: Hodnotu pole nemůže uživatel změnit.

source: Unmodifiable
cs: Nezměnitelné

source: Used as the email subject when email_send_notification is checked.
cs: Použito jako předmět e-mailu, pokud je zaškrtnuto pole Při odeslání formuláře zaslat upozornění.

source: When checked, the value of this field will be used to send an email notification.
cs: Je-li zaškrtnuto, bude se při odeslání formuláře zasílat e-mailové upozornění.

source: columns
cs: slupce

source: email subject
cs: předmět zprávy

source: rows
cs: řádky

source: send notification when form is submitted
cs: při odeslání formuláře zaslat upozornění
