Repository: pypi-data/pypi-mirror-386
Catalog: packages/betty/betty-0.4.30.tar.gz/betty-0.4.30/betty/assets/locale/*/betty.po
Languages: uk

source: Timeline
uk: Хронологія

source: Toggle full screen
uk: Перемкнути на весь екран

source: Town
uk: Містечко

source: Trees
uk: Дерева

source: Unauthorized
uk: Неавторизовано

source: Unknown
uk: Невідомо

source: Unknown file format "{extension}". Supported formats are: {available_formats}.
uk: Невідомий формат файлу "{extension}". Підтримувані формати: {available_formats}.

source: Unknown key: {unknown_key}.
uk: Невідомий ключ: {unknown_key}.

source: Update all existing translations
uk: Оновити всі наявні переклади

source: Update all existing translations for Betty itself
uk: Оновити всі наявні переклади для самої Betty

source: Update all existing translations for an extension
uk: Оновити всі наявні переклади для розширення

source: Updated {updated_derivations} {event_type} events based on existing information.
uk: Оновлено {updated_derivations} подій типу {event_type} на основі наявної інформації.

source: Use <kbd>↑</kbd> and <kbd>↓</kbd> to navigate results, or <kbd>esc</kbd> to exit the search.
uk: Використовуйте <kbd>↑</kbd> і <kbd>↓</kbd> для переміщення по результатах або <kbd>esc</kbd> для виходу з пошуку.

source: View original
uk: Переглянути оригінал

source: View the documentation
uk: Переглянути документацію

source: Village
uk: Село

source: Welcome to %(project_title)s
uk: Ласкаво просимо на %(project_title)s

source: What is the path to your exported Gramps family tree file?
uk: Який шлях до вашого експортованого файлу генеалогічного дерева Gramps?

source: What is the project author called in {locale}?
uk: Як називається автор проєкту для мови {locale}?

source: What is your project called in {locale}?
uk: Як називається ваш проєкт для мови {locale}?

source: What is your project's machine name?
uk: Яка машинна назва вашого проєкту?

source: Where do you want to save your project's configuration file?
uk: Де ви хочете зберегти файл конфігурації вашого проєкту?

source: Which language should your project site be generated in? Enter an IETF BCP 47 language code.
uk: Якою мовою має бути згенеровано ваш сайт проєкту? Введіть мовний код IETF BCP 47.

source: Wikipedia
uk: Вікіпедія

source: Wikipedia contributors
uk: Учасники Вікіпедії

source: Will
uk: Заповіт

source: Witness
uk: Свідок

source: Witnesses
uk: Свідки

source: Works in the public domain can be used or referenced without permission, because nobody holds any exclusive rights over these works (anymore).
uk: Твори в публічному домені можна використовувати або посилатися на них без дозволу, оскільки ніхто більше не має виключних прав на ці твори.

source: Your browser cannot show PDF documents. <a href="%(file_url)s">Download %(file_name)s</a> to view it on your device instead.
uk: Ваш браузер не може відобразити PDF-документи. <a href="%(file_url)s">Завантажте %(file_name)s</a>, щоб переглянути його на своєму пристрої.

source: Your project has no theme enabled. This means your site's pages may look bare. Try the "raspberry-mint" extension.
uk: У вашому проекті не ввімкнено тему. Це означає, що сторінки вашого сайту можуть виглядати голими. Спробуйте нарощування «Raspberry Mint».

source: Zoom in
uk: Збільшити масштаб

source: Zoom out
uk: Зменшити масштаб

source: around {date}
uk: близько {date}

source: from around {start_date}
uk: приблизно з {start_date}

source: from around {start_date} until around {end_date}
uk: приблизно з {start_date} приблизно до {end_date}

source: from around {start_date} until sometime before around {end_date}
uk: приблизно з {start_date} до десь до {end_date}

source: from around {start_date} until sometime before {end_date}
uk: приблизно з {start_date} до десь раніше {end_date}

source: from around {start_date} until {end_date}
uk: приблизно з {start_date} до {end_date}

source: from sometime after around {start_date} until around {end_date}
uk: десь приблизно після {start_date} приблизно до {end_date}

source: from sometime after around {start_date} until {end_date}
uk: приблизно від {start_date} до {end_date}

source: from sometime after {start_date} until around {end_date}
uk: десь після {start_date} приблизно до {end_date}

source: from sometime after {start_date} until {end_date}
uk: Приблизно після {start_date} до {end_date}

source: from {start_date}
uk: з {start_date}

source: from {start_date} until around {end_date}
uk: з {start_date} до приблизно {end_date}

source: from {start_date} until sometime before around {end_date}
uk: з {start_date} до десь до {end_date}

source: from {start_date} until sometime before {end_date}
uk: з {start_date} до десь раніше {end_date}

source: from {start_date} until {end_date}
uk: з {start_date} до {end_date}

source: in %(place)s
uk: в %(place)s

source: in %(source)s
uk: в %(source)s

source: npm (https://www.npmjs.com/) must be available for features that require Node.js packages to be installed. Ensure that the `npm` executable is available in your `PATH`.
uk: npm (https://www.npmjs.com/) має бути доступним для функцій, які вимагають встановлення пакетів Node.js. Переконайтеся, що виконуваний файл `npm` доступний у вашому `PATH`.

source: npm is available
uk: npm доступний

source: npm is not available
uk: npm недоступний

source: private
uk: приватні

source: show %(name_count)s more
uk: показати %(name_count)s

source: show fewer
uk: показувати менше

source: show less
uk: показувати більше

source: show more
uk: показати більше

source: sometime
uk: колись

source: sometime after around {start_date}
uk: десь приблизно після {start_date}

source: sometime after {start_date}
uk: десь після {start_date}

source: sometime before around {end_date}
uk: десь приблизно до {end_date}

source: sometime before {end_date}
uk: десь до {end_date}

source: sometime between around {start_date} and around {end_date}
uk: десь між приблизно {start_date} та приблизно {end_date}

source: sometime between around {start_date} and {end_date}
uk: десь між приблизно {start_date} та {end_date}

source: sometime between {start_date} and around {end_date}
uk: десь між {start_date} і близько {end_date}

source: sometime between {start_date} and {end_date}
uk: десь між {start_date} та {end_date}

source: unknown date
uk: невідома дата

source: until around {end_date}
uk: приблизно до {end_date}

source: until {end_date}
uk: до {end_date}

source: y
uk: y року

source: {count} citation
uk: {count} цитата

source: {count} enclosure
uk: {count} корпус

source: {count} entity
uk: {count} сутність

source: {count} event
uk: {count} подія

source: {count} file
uk: {count} файл

source: {count} file reference
uk: {count} посилання на файл

source: {count} note
uk: {count} примітка

source: {count} person
uk: {count} людина

source: {count} person name
uk: {count} ім'я особи

source: {count} place
uk: {count} місце

source: {count} presence
uk: {count} присутні

source: {count} source
uk: {count} джерело

source: {dependent_label} requires {dependency_labels}.
uk: {dependent_label} вимагає {dependency_labels}.

source: {event_type} of {subjects}
uk: {event_type} {subjects}

source: {extension} does not have an assets directory.
uk: У розширення {extension} відсутній каталог assets.

source: © Copyright the author, unless otherwise credited
uk: © Авторське право належить автору, якщо не зазначено інше

source: © Copyright {author}, unless otherwise credited
uk: © Авторське право {author}, якщо не зазначено інше
