Repository: pypi-data/pypi-mirror-386
Catalog: packages/betty/betty-0.4.30.tar.gz/betty-0.4.30/betty/assets/locale/*/betty.po
Languages: uk

source: "{hex_value}" is not a valid hexadecimal color, such as #ffc0cb.
uk: "{hex_value}" не є дійсним шістнадцятковим кольором, як-от #ffc0cb.

source: "{invalid_locale}" is not a valid IETF BCP 47 language tag.
uk: "{invalid_locale}" не є дійсним мовним тегом IETF BCP 47.

source: "{path}" is not a directory.
uk: "{path}" не є каталогом.

source: "{value}" is not a valid machine name: only lowercase letters, digits, and hyphens (-) are allowed.
uk: "{value}" не є дійсним ім’ям для машини: дозволені лише малі літери, цифри та дефіси (-).

source: %(date)s in %(place)s
uk: %(date)s в %(place)s

source: %(event)s of %(subjects)s
uk: %(event)s %(subjects)s

source: %(event)s with %(subjects)s
uk: %(event)s з %(subjects)s

source: %(person_individual_name)s had a child with %(co_parent_labels)s.
uk: %(person_individual_name)s має одну дитину з %(co_parent_labels)s.

source: %(person_individual_name)s had a child.
uk: %(person_individual_name)s має одну дитину.

source: %(person_individual_name)s is the child of %(parent_labels)s.
uk: %(person_individual_name)s дитина %(parent_labels)s.

source: A family history as told by <a href="https://betty.readthedocs.io">Betty👵</a>
uk: Сімейна історія, яку розповіла <a href="https://betty.readthedocs.io">Betty👵</a>

source: API documentation
uk: документація API

source: About
uk: Про програму

source: Access denied
uk: Доступ заборонено

source: Accessed %(date)s
uk: Доступ %(date)s

source: Adoption
uk: Усиновлення

source: All caches cleared.
uk: Усі кеші очищено.

source: All of these requirements must be met
uk: Усі ці вимоги мають бути виконані

source: All rights reserved
uk: Усі права захищено

source: Also known as %(names)s
uk: Також відомий як %(names)s

source: Ancestral names include
uk: Імена предків є

source: Announcement of divorce
uk: Оголошення про розлучення

source: Announcement of marriage
uk: Оголошення шлюбу

source: Appearances
uk: Знайдено в

source: At least {expected} items are required, but found {actual}.
uk: Потрібно щонайменше {expected} елементів, але знайдено {actual}.

source: At most {expected} items are allowed, but found {actual}.
uk: Дозволено не більше {expected} елементів, але знайдено {actual}.

source: At which URL will your site be published?
uk: За якою URL-адресою буде опубліковано ваш сайт?

source: Attendee
uk: Відвідувач

source: Baptism
uk: Хрещення

source: Bar mitzvah
uk: Бар-міцва

source: Bat mitzvah
uk: Бат-міцва

source: Beneficiary
uk: Бенефіціар

source: Betty could not load the SPDX licenses
uk: Betty не вдалося завантажити ліцензії SPDX

source: Betty is an application that takes a family tree and builds a website out of it, much like the one you are viewing right now. The more information your genealogical research contains, the more interactivity Betty can add to your site, such as media galleries, maps, and browsable family trees.
uk: Betty — це застосунок, який бере генеалогічне дерево та створює з нього вебсайт, подібний до того, який ви переглядаєте зараз. Чим більше інформації містить ваше генеалогічне дослідження, тим більше інтерактивності Betty може додати до вашого сайту, наприклад, медіагалереї, мапи та переглядувані генеалогічні дерева.

source: Betty is unfamiliar with Gramps event "{event_id}"'s type of "{gramps_event_type}". The event was imported, but its type was set to "{betty_event_type}".
uk: Betty не знайома з типом події Gramps "{event_id}" як "{gramps_event_type}". Подія була імпортована, але її тип змінено на "{betty_event_type}".

source: Betty is unfamiliar with Gramps file "{file_id}"'s copyright notice ID of "{copyright_notice_id}" and ignored it.
uk: Betty не знайома з ID авторського права файлу Gramps "{file_id}" як "{copyright_notice_id}" і проігнорувала його.

source: Betty is unfamiliar with Gramps file "{file_id}"'s license ID of "{license_id}" and ignored it.
uk: Betty не знайома з ID ліцензії файлу Gramps "{file_id}" як "{license_id}" і проігнорувала його.

source: Betty is unfamiliar with Gramps place "{place_id}"'s type of "{gramps_place_type}". The place was imported, but its type was set to "{betty_place_type}".
uk: Betty не знайома з типом місця Gramps "{place_id}" як "{gramps_place_type}". Місце було імпортоване, але його тип змінено на "{betty_place_type}".

source: Betty is unfamiliar with person "{person_id}"'s Gramps presence role of "{gramps_presence_role}" for the event with Gramps handle "{event_handle}". The role was imported, but set to "{betty_presence_role}".
uk: Betty не знайома з роллю присутності особи Gramps "{person_id}" як "{gramps_presence_role}" для події з ідентифікатором Gramps "{event_handle}". Роль була імпортована, але змінена на "{betty_presence_role}".

source: Betty was named after %(liberta_lankester_label)s, and this website shows a small sample of her family history. You can browse the pages about her and some of her family to get an idea of what a Betty site looks like.
uk: Назва Betty походить від %(liberta_lankester_label)s, а цей вебсайт показує невелику частину її сімейної історії. Ви можете переглянути сторінки про неї та деяких її родичів, щоб отримати уявлення про те, як виглядає сайт Betty.

source: Betty will talk to you in {locale}
uk: Betty спілкуватиметься з вами мовою {locale}

source: Birth
uk: Народження

source: Borough
uk: Боро

source: Building
uk: Будівля

source: Built the Webpack front-end assets.
uk: Фронтенд-ресурси Webpack зібрані.

source: Burial
uk: Поховання

source: Cannot find an available port to bind the web server to.
uk: Не вдалося знайти доступний порт для прив'язки вебсерверу.

source: Cannot find and import "{plugin_id}".
uk: Не вдалося знайти та імпортувати "{plugin_id}".

source: Cannot find locale {locale}.
uk: Не вдалося знайти локаль {locale}.

source: Cannot generate pages for {entity_type}, because it is not a user-facing entity type.
uk: Неможливо згенерувати сторінки для {entity_type}, оскільки це тип сутності, що не призначений для користувачів.

source: Cannot load Gramps file {file_id} with relative path {file_path}, because your family tree does not include a base path. In Gramps, add a "base path for relative media paths" to your family tree, and export it again.
uk: Не можу завантажити Gramps файл {file_id} з відносним шляхом {file_path}, оскільки ваше сімейне дерево не містить базового шляху. У Gramps додайте "Базовий шлях для відносних медіа шляхів" до вашого сімейного дерева, і експортуйте його знову.

source: Cannot load Gramps file {file_id}, because {file_path} is not a file.
uk: Не можна завантажити Gramps файл {file_id}, тому що {file_path} не є файлом.

source: Cannot load coordinates "{coordinates}", because they are in an unknown format.
uk: Неможливо завантажити координати "{coordinates}", оскільки вони в невідомому форматі.

source: Celebrant
uk: Святкуючий

source: Citation
uk: Цитата

source: Citations
uk: Цитати

source: City
uk: Місто

source: Clear all caches
uk: Очистити всі кеші

source: Close
uk: Закрити

source: Conference
uk: Конференція

source: Configure Betty
uk: Налаштувати Betty

source: Confirmation
uk: Миропомазання

source: Continue reading on <a href="%(url)s">Wikipedia</a>.
uk: Продовжуйте читати у <a href="%(url)s">Вікіпедії</a>.

source: Copyright
uk: Авторське право

source: Copyright <a href="%(url)s">OpenStreetMap</a> contributors
uk: Авторські права авторів <a href="%(url)s">OpenStreetMap</a>

source: Copyright Wikipedia contributors
uk: Авторське право належить учасникам Wikipedia

source: Copyright of these works lies with the original authors who contributed them to Wikipedia.
uk: Авторське право на ці роботи належить оригінальним авторам, які додали їх до Wikipedia.

source: Correspondence
uk: Листування

source: Cotton Candy is Betty's legacy theme.
uk: Цукрова вата - тема спадщини Betty.

source: Could not extract {file_path} as a gzip file (*.gz).
uk: Не вдалося розпакувати {file_path} як gzip файл (*.gz).

source: Could not extract {file_path} as a gzipped tar file (*.tar.gz).
uk: Не вдалося розпакувати {file_path} як архівований gzip файл (*.tar.gz).

source: Could not find a plugin "{plugin_id}".
uk: Не вдалося знайти плагін "{plugin_id}".

source: Could not find any of the following configuration files in {project_directory_path}: {configuration_file_names}.
uk: Не вдалося знайти жоден з наступних конфігураційних файлів у {project_directory_path}: {configuration_file_names}.

source: Could not find the file "{file_path}".
uk: Не вдалося знайти файл "{file_path}".

source: Could not load "{file_path}" as a *.gpkg, a *.gramps, or an *.xml family tree.
uk: Не вдалося завантажити "{file_path}" як *.gpkg, *.gramps або *.xml генеалогічне дерево.

source: Country
uk: Країна

source: County
uk: Округ

source: Create a new project
uk: Створити новий проєкт

source: Create a new translation
uk: Створити новий переклад

source: Create a new translation for an extension
uk: Створити новий переклад для розширення

source: Create events such as births and deaths by deriving their details from existing information.
uk: Створюйте події, такі як народження та смерть, шляхом виведення їх деталей з наявної інформації.

source: Created {created_derivations} additional {event_type} events based on existing information.
uk: Створено {created_derivations} додаткових подій типу {event_type} на основі наявної інформації.

source: Cremation
uk: Кремація

source: Death
uk: Смерть

source: Department
uk: Відділ

source: Deriver
uk: Похідне

source: Deriving...
uk: Виведення...

source: Descendant names include
uk: Імена нащадків є

source: Description, licensing, and image history
uk: Опис, ліцензування та історія зображення

source: Determine if people can be proven to have died. If not, mark them and their associated entities private.
uk: Визначте, чи можна довести, що людина померла. Якщо ні, позначте її та пов'язані з нею сутності як приватні.

source: Display interactive family trees using <a href="https://cytoscape.org/">Cytoscape</a>.
uk: Відображайте інтерактивні генеалогічні дерева за допомогою <a href="https://cytoscape.org/">Cytoscape</a>.

source: Display interactive maps
uk: Відображайте списки місць у вигляді інтерактивних мап

source: Display the HTTP API documentation in a user-friendly way using <a href="https://swagger.io/tools/swagger-ui">Swagger UI</a>.
uk: Відображайте документацію HTTP API у зручному форматі за допомогою <a href="https://swagger.io/tools/swagger-ui">Swagger UI</a>.

source: District
uk: Район

source: Divorce
uk: Розлучення

source: Do you mean one of {available_options}?
uk: Ви мали на увазі один із {available_options}?

source: Do you mean {available_option}?
uk: Ви мали на увазі {available_option}?

source: Do you want to add another locale?
uk: Бажаєте додати ще одну локаль?

source: Do you want to load a Gramps family tree?
uk: Бажаєте завантажити генеалогічне дерево Gramps?

source: E.g. "%(example)s"
uk: Наприклад «%(example)s»

source: Emigration
uk: Еміграція

source: Enclosure
uk: Документ-додаток

source: Enclosures
uk: Документи-додатки

source: Engagement
uk: Заручини

source: Enrich your ancestry with information from Wikipedia
uk: Збагатити своїх предків з інформацією з Вікіпедії

source: Entity type
uk: Тип сутності

source: Event
uk: Подія

source: Events
uk: Події

source: Exactly {expected} items are required, but found {actual}.
uk: Потрібно рівно {expected} елементів, але знайдено {actual}.

source: Exit the search
uk: Вийдіть із пошуку

source: Explore a demonstration site
uk: Ознайомтеся з демонстраційним сайтом

source: External links
uk: Зовнішні посилання

source: Facts
uk: Факти

source: Family
uk: Сім'я

source: Farm
uk: Ферма

source: Female
uk: Жінка

source: File
uk: Файл

source: File reference
uk: Посилання на файл

source: File references
uk: Посилання на файли

source: Files
uk: Файли

source: Filters
uk: Фільтри

source: Find Betty on GitHub
uk: Знайдіть Betty на GitHub

source: Find out more about this image on Wikimedia Commons.
uk: Дізнайтеся більше про це зображення на Wikimedia Commons.

source: Funeral
uk: Похорон

source: Generate a static site
uk: Згенерувати статичний сайт

source: Generated {completed_job_count} out of {total_job_count} items ({completed_job_percentage}%).
uk: Згенеровано {completed_job_count} із {total_job_count} елементів ({completed_job_percentage}%).

source: Generating JSON Schema...
uk: Генерація схеми JSON...

source: Generating OpenAPI specification...
uk: Генерація специфікації OpenAPI...

source: Generating localized public files in {locale}...
uk: Генерація локалізованих публічних файлів для {locale}...

source: Generating static public files...
uk: Генерація статичних публічних файлів...

source: Generating your site to {output_directory}.
uk: Генерація вашого сайту в {output_directory}.

source: Go to the front page
uk: Перейти на першу сторінку

source: Gramps XML must be compatible with version {supported_gramps_xml_version}. Gramps XML {loaded_gramps_xml_version} is not supported.
uk: Gramps XML має бути сумісним із версією {supported_gramps_xml_version}. Gramps XML {loaded_gramps_xml_version} не підтримується.

source: HTTP API Documentation
uk: документація HTTP API

source: Hamlet
uk: Хутір

source: I'm sorry, dear, but it seems there are no events.
uk: Вибачте, любий, але, здається, немає подій.

source: I'm sorry, dear, but it seems there are no media.
uk: Вибачте, любий, але, здається, немає медіа.

source: I'm sorry, dear, but it seems there are no people.
uk: Вибачте, любий, але, здається, немає людей.

source: I'm sorry, dear, but it seems there are no places.
uk: Вибачте, любий, але, здається, немає місць.

source: I'm sorry, dear, but it seems there are no sources.
uk: Вибачте, любий, але, здається, немає джерел.

source: I'm sorry, dear, but it seems there is nothing to show.
uk: Вибачте, любий, але, здається, нема чого показати.

source: I'm sorry, dear, but it seems this page does not exist.
uk: Вибачте, любий, але, здається, ця сторінка не існує.

source: I'm sorry, dear, but it seems you're not allowed to view this page.
uk: Вибачте, любий, але, здається, вам не дозволено переглядати цю сторінку.

source: I'm sorry, dear, but it seems you're not logged in.
uk: Вибачте, любий, але, здається, ви не увійшли в систему.

source: Immigration
uk: Імміграція

source: Informant
uk: Інформатор

source: Invalid JSON: {error}.
uk: Недійсний JSON: {error}.

source: Invalid YAML: {error}.
uk: Недійсний YAML: {error}.

source: Keywords
uk: Ключові слова

source: Language
uk: Мова

source: Last modified on %(last_modified)s
uk: Остання зміна %(last_modified)s

source: License
uk: Ліцензія

source: Load <a href="https://gramps-project.org/">Gramps</a> family trees.
uk: Завантажити генеалогічні дерева <a href="https://gramps-project.org/">Gramps</a>.

source: Loaded the configuration from {configuration_file_path}.
uk: Конфігурацію завантажено з {configuration_file_path}.

source: Loaded {citation_count} citations.
uk: Завантажено {citation_count} цитат.

source: Loaded {event_count} events.
uk: Завантажено {event_count} подій.

source: Loaded {file_count} files.
uk: Завантажено {file_count} файлів.

source: Loaded {note_count} notes.
uk: Завантажено {note_count} нотаток.

source: Loaded {person_count} people.
uk: Завантажено {person_count} осіб.

source: Loaded {place_count} places.
uk: Завантажено {place_count} місць.

source: Loaded {repository_count} repositories as sources.
uk: Завантажено {repository_count} репозиторіїв як джерела.

source: Loaded {source_count} sources.
uk: Завантажено {source_count} джерел.

source: Loading "{file_path}"...
uk: Завантаження "{file_path}"...

source: Locale aliases must not contain slashes.
uk: Аліаси локалей не повинні містити слешів.

source: Locality
uk: Місцевість

source: MMMM d
uk: d MMMM

source: MMMM d, y
uk: d MMMM y року

source: MMMM, y
uk: MMMM y року

source: Male
uk: Чоловік

source: Maps
uk: Мапи

source: Marriage
uk: Шлюб

source: Media
uk: Медіа

source: Media references
uk: Медіа посилання

source: Menu
uk: Меню

source: Missing
uk: Відсутній

source: Municipality
uk: Муніципалітет

source: Neighborhood
uk: Околиці

source: No part may be reproduced or distributed in any form or by any means, without express written permission from the copyright holder, or unless permitted by copyright law.
uk: Жодна частина не може бути відтворена або розповсюджена в будь-якій формі або будь-якими засобами без письмового дозволу власника авторських прав або якщо це не дозволено законом про авторське право.

source: Non-binary
uk: Небінарний

source: Note
uk: Нотатка

source: Notes
uk: Примітки

source: Number
uk: Номер

source: Occupation
uk: Праця

source: One or more of these requirements must be met
uk: Потрібно виконати одну або кілька з цих вимог

source: Organizer
uk: Організатор

source: Other attendees
uk: Інші учасники

source: Other places contained by this one
uk: Інші місця, які містяться в цьому

source: Page not found
uk: Сторінку не знайдено

source: Parish
uk: Парафія

source: People
uk: Люди

source: Permanent link to this section.
uk: Постійне посилання на цей розділ.

source: Person
uk: Особа

source: Person name
uk: Ім'я особи

source: Person names
uk: Імена осіб

source: Place
uk: Місце

source: Places
uk: Місця

source: Plugin {plugin_label} ({plugin_id}) is not configurable, but configuration was given.
uk: Плагін {plugin_label} ({plugin_id}) не налаштовується, але були надані параметри налаштування.

source: Presence
uk: Присутність

source: Presence of {person} at {event}
uk: Присутність {person} на {event}

source: Presences
uk: Присутності

source: Privatized person {privatized_person_id} ({privatized_person}) because they are likely still alive.
uk: Особа {privatized_person_id} ({privatized_person}) була зроблена приватною, оскільки, ймовірно, вона ще жива.

source: Privatized place {privatized_place_id} ({privatized_place}) because it is not associated with any public information.
uk: Місце {privatized_place_id} ({privatized_place}) було зроблене приватним, оскільки воно не пов’язане з жодною публічною інформацією.

source: Privatized {count} people because they are likely still alive.
uk: Приватизовано {count} осіб, оскільки, ймовірно, вони ще живі.

source: Privatized {count} {entity_type}, because they are associated with private information.
uk: Приватизовано {count} {entity_type}, оскільки вони пов’язані з приватною інформацією.

source: Privatized {privatized_entity_type} {privatized_entity_id} ({privatized_entity}) because of {reason_entity_type} {reason_entity_id} ({reason_entity}).
uk: {privatized_entity_type} {privatized_entity_id} ({privatized_entity}) зроблено приватним через {reason_entity_type} {reason_entity_id} ({reason_entity}).

source: Privatizer
uk: Приватизатор

source: Privatizing...
uk: Приватизація...

source: Project author
uk: Автор проєкту

source: Province
uk: Провінція

source: Public domain
uk: Публічний домен

source: Read more
uk: Читати далі

source: Read more on Wikipedia.
uk: Детальніше читайте у Вікіпедії.

source: Read the Betty documentation
uk: Прочитайте документацію Betty

source: References
uk: Референції

source: Region
uk: Регіон

source: Reset
uk: Скинути

source: Residence
uk: Проживання

source: Results ({{{ betty-search-results-count }}})
uk: Результати ({{ betty-search-results-count }})

source: Retirement
uk: Вихід на пенсію

source: Saved your project to {configuration_file}.
uk: Проєкт збережено у {configuration_file}.

source: Search
uk: Пошук

source: Serve a generated site
uk: Запустити згенерований сайт

source: Serving your site at {url}...
uk: Сайт запущено за адресою {url}...

source: Source
uk: Джерелo

source: Sources
uk: Джерела

source: Speaker
uk: Доповідач

source: Starting Python's built-in web server...
uk: Запуск вбудованого вебсерверу Python...

source: State
uk: Штат

source: Street
uk: Вулиця

source: Subject
uk: Предмет

source: Subjects
uk: Предмети

source: The '%(project_title)s' logo
uk: Логотип «%(project_title)s»

source: The Gramps {gramps_entity_reference} entity has a "betty:link-{link_name}:media_type" attribute with value "{media_type}", which is not a valid IANA media type. This media type was ignored.
uk: Сутність Gramps {gramps_entity_reference} має атрибут "betty:link-{link_name}:media_type" зі значенням "{media_type}", яке не є дійсним медіа-типом IANA. Цей медіа-тип було проігноровано.

source: The Gramps {gramps_entity_reference} entity requires a "betty:link-{link_name}:url" attribute. This link was ignored.
uk: Сутність Gramps {gramps_entity_reference} потребує атрибут "betty:link-{link_name}:url". Це посилання було проігноровано.

source: The URL must include a host.
uk: URL має містити хост.

source: The URL must start with a scheme such as https:// or http://.
uk: URL має починатися зі схеми, наприклад, https:// або http://.

source: The betty:privacy Gramps attribute must have a value of "public" or "private", but "{privacy_value}" was given for {entity_type} {entity_id} ({entity_label}), which was ignored.
uk: Атрибут betty:privacy у Gramps повинен мати значення "public" або "private", але для {entity_type} {entity_id} ({entity_label}) було задано "{privacy_value}", що було проігноровано.

source: The entity reference must be for an entity of type {expected_entity_type_id}, but instead does not specify an entity type at all.
uk: Посилання на сутність має бути для сутності типу {expected_entity_type_id}, але замість цього взагалі не вказувати тип сутності.

source: The entity reference must be for an entity of type {expected_entity_type_id}, but instead is for an entity of type {actual_entity_type_id}.
uk: Посилання на сутність має бути для сутності типу {expected_entity_type_id}, але натомість для сутності типу {actual_entity_type_id}.

source: The following errors occurred
uk: Виникли наступні помилки

source: The server at {url} was unreachable after starting.
uk: Сервер за адресою {url} залишився недоступним після запуску.

source: There are no available options.
uk: Немає доступних варіантів.

source: They are the child of %(parent_labels)s.
uk: Це дитина %(parent_labels)s.

source: They grew up with a sibling.
uk: Вони виросли з %(sibling_count)s братом або сестрою.

source: They had a child with %(co_parent_labels)s.
uk: У них була одна дитина з %(co_parent_labels)s.

source: They had a child.
uk: У них була %(child_count)s дитина.

source: This citation's details are unavailable to protect people's privacy.
uk: Деталі цієї цитати недоступні для захисту приватності людей.

source: This field is required.
uk: Це поле є обов’язковим.

source: This information is unavailable to protect people's privacy.
uk: Ця інформація недоступна для захисту конфіденційності людей.

source: This is not valid Gramps XML.
uk: Це недійсний XML Gramps.

source: This must be a boolean.
uk: Це має бути булеве значення.

source: This must be a decimal number.
uk: Це має бути десяткове число.

source: This must be a key-value mapping.
uk: Це має бути відображення ключ-значення.

source: This must be a positive number.
uk: Це має бути додатнє число.

source: This must be a sequence.
uk: Це має бути послідовність.

source: This must be a string.
uk: Це має бути рядок.

source: This must be a whole number.
uk: Це має бути ціле число.

source: This must be none/null.
uk: Це має бути значення none/null.

source: This person's details are unavailable to protect their privacy.
uk: Дані цієї особи недоступні для захисту їх конфіденційності.

source: This person's name is unavailable to protect their privacy.
uk: Ім’я даних цієї особи недоступне для захисту її конфіденційності.

source: This person's name is unknown.
uk: Ім'я цієї людини невідоме.

source: This source's details are unavailable to protect people's privacy.
uk: Деталі цього джерела недоступні для захисту приватності людей.
