
i1 : m1 = id_(QQ^10)^{1,6,2,7,3,8,4,9,5,0}

o1 = | 0 1 0 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 1 0 0 0 |
     | 0 0 1 0 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 1 0 0 |
     | 0 0 0 1 0 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 0 1 0 |
     | 0 0 0 0 1 0 0 0 0 0 |
     | 0 0 0 0 0 0 0 0 0 1 |
     | 0 0 0 0 0 1 0 0 0 0 |
     | 1 0 0 0 0 0 0 0 0 0 |

              10        10
o1 : Matrix QQ   <--- QQ

i2 : m2 = id_(QQ^10)^{1,0,2,3,4,5,6,7,8,9}

o2 = | 0 1 0 0 0 0 0 0 0 0 |
     | 1 0 0 0 0 0 0 0 0 0 |
     | 0 0 1 0 0 0 0 0 0 0 |
     | 0 0 0 1 0 0 0 0 0 0 |
     | 0 0 0 0 1 0 0 0 0 0 |
     | 0 0 0 0 0 1 0 0 0 0 |
     | 0 0 0 0 0 0 1 0 0 0 |
     | 0 0 0 0 0 0 0 1 0 0 |
     | 0 0 0 0 0 0 0 0 1 0 |
     | 0 0 0 0 0 0 0 0 0 1 |

              10        10
o2 : Matrix QQ   <--- QQ

i3 : GAP = newConnection "127.0.0.1:26135"

o3 = SCSCP Connection to GAP (4.dev) on 127.0.0.1:26135

o3 : SCSCPConnection

i4 : G = GAP <=== matrixGroup({m1,m2})

o4 = << Remote GAP object >>

o4 : RemoteObject

i5 : <== size G

o5 = 10080

i6 : close GAP

i7 : 
