Repository: pypi-data/pypi-mirror-386
Catalog: packages/djangocms-oidc/djangocms_oidc-5.1.0-py3-none-any.whl/djangocms_oidc/locale/*/LC_MESSAGES/django.po
Languages: cs

source: A new account has been created with the username {} and email {}.
cs: Byl vytvořen nový účet pro uživatele {} a e-mail {}.

source: Account URL
cs: Účet URL

source: Authorization endpoint
cs: Koncový bod autorizace

source: Button label
cs: Text tlačítka

source: Button text for unlogged in user.
cs: Text tlačítka pro nepřihlášeného uživatele.

source: CMS Page
cs: CMS Stránka

source: CSS names
cs: CSS názvy

source: Claims
cs: Požadované údaje

source: Claims attributes for data handover.
cs: Požadované údaje pro předání dat.

source: Claims example:
cs: Příklad předaných údajů:

source: Client ID
cs: Klient ID

source: Client secret
cs: Klientský soukromý klíč

source: Code
cs: Kód

source: Communication with the provider failed. Please try again later.
cs: Komunikace s poskytovatelem se nezdařila. Prosím, zkuste to znovu později.

source: Communication with the provider is in progress. Please try again later.
cs: Komunikace s poskytovatelem právě probíhá. Prosím, zkuste to znovu později.

source: Conditions
cs: Podmínky

source: Consider the data invalid if not all the required data has been handovered.
cs: Považovat údaje za neplatná, pokud nejsou předány všechny povinné položky.

source: Data handover from %(provider_name)s
cs: Údaje předané od %(provider_name)s

source: Default value
cs: Výchozí hodnota

source: Delete selected
cs: Smazat vybrané

source: Dismiss
cs: Zrušit

source: Dismiss data from %(provider_name)s.
cs: Zrušit údaje od %(provider_name)s.

source: Display content only for authenticated users or users with data hangovered from provider.
cs: Zobrazit obsah pouze přihlášeným uživatelům nebo uživatelům s údaji předanými od poskytovatele.

source: Do not create a new user account if the user is not recognized.
cs: Nevytvářet nový uživatelský účet, pokud uživatel nebyl rozpoznán.

source: Email is not verified.
cs: E-mail není ověřený.

source: Email missing.
cs: E-mail chybí.

source: Email verified
cs: Ověřený e-mail

source: Extra class names (separated by space).
cs: Názvy dalších CSS tříd (položky oddělené mezerou).

source: Force consent with handovered data
cs: Vynutit souhlas s předávanými údaji

source: Force login
cs: Vynutit přihlášení

source: Handover the remaining data
cs: Předat zbývající údaje

source: Identifier
cs: Identifikátor

source: Identifier has been deleted.
cs: Identifikátor byl smazán.

source: Insist on required claims
cs: Trvat na povinných údajích

source: Item "No interaction" cannot be combined with others.
cs: Položka "Jen bez dotazování"' nelze s ostatními kombinovat.

source: Login
cs: Přihlásit

source: Login by %(provider_name)s
cs: Přihlásit přes %(provider_name)s

source: Login failed.
cs: Přihlášení se nezdařilo.

source: Logout
cs: Odhlásit

source: Logout URL
cs: Odhlášení URL

source: Name
cs: Jméno

source: No identifier has been deleted. Check one to delete.
cs: Žádný identifikátor nebyl smazán. Pro smazání některý zaškrtněte.

source: No interaction
cs: Jen bez dotazování

source: No new user
cs: Ne nový uživatel

source: Not all required data has been handovered.
cs: Nebyly předány všechny požadované údaje.

source: Not all required data has been handovered. Please make the transfer again and select all the required values.
cs: Nebyly předány všechny požadované údaje. Prosím přihlašte se znova a vyberte všechny povinné položky.

source: OIDC Consumer activation failed during authentication. Please try again.
cs: Aktivace OIDC Consumera během autentizace se nezdařila. Prosím, zkusete to znova.

source: OIDC Consumer activation falied. Please try again.
cs: Aktivace OIDC Consumera se nezdařila. Prosím, zkusete to znova.

source: OIDC Display dedicated content
cs: OIDC Zobrazit vyhrazený obsah

source: OIDC Handover data
cs: OIDC Předání údajů

source: OIDC List identifiers
cs: OIDC Seznam identifikátorů

source: OIDC Login
cs: OIDC Přihlášení

source: OIDC Show attribute
cs: OIDC Zobrazit atribut

source: OIDC Show attribute Country
cs: OIDC Zobrazit atribut Země

source: OIDC authentication
cs: OIDC autentizace

source: OIDC identifiers
cs: OIDC identifikátory

source: OIDC providers
cs: OIDC poskytovatelé

source: OIDC register consumers
cs: OIDC registrace konsumerů

source: Only authenticated user
cs: Jen přihlášený uživatel

source: Only user is staff
cs: Jen editor

source: Pair by %(provider_name)s
cs: Spárovat s %(provider_name)s

source: Pair my account with an identity provider
cs: Spárovat můj účet s poskytovatelem identity

source: Pairing cannot be performed. This identifier is already paired with another account.
cs: Spárování nelze provést. Tento identifikátor je již spárován s jiným účtem.

source: Prompt
cs: Výzva

source: Prompt for user at authorization. "No interaction" cannot be combined with others.
cs: Výzva na uživatele při autorizaci. "Jen bez dotazování"' nelze s ostatními kombinovat.

source: Provider name
cs: Název poskytovatele

source: Provider unique identifier.
cs: Unikátní identifikátor poskytovatele.

source: Redirect to the page after login or hangover data.
cs: Přesměrování na stránku po přihlášení nebo předání údajů.

source: Register consumer
cs: Registrovat odběratele

source: Register consumer URL
cs: Registrovat odběratele URL

source: Register consumer automaticaly, when it is not. (Client ID and secret missing).
cs: Automaticky registrovat odběratele, pokud není. (Klient ID a soukromý klíč chybí).

source: Register consumer on the provider, when Client ID and secret are not set.
cs: Registrovat odběratele u poskytovatele, pokud Klient ID a soukromý klíč nejsou zadány.

source: Registration name
cs: Název registrace

source: Show content only if the given conditions are met.
cs: Zobrazit obsah jen pokud jsou dané podmínky splněny.

source: Show this text when attribute has not been handovered.
cs: Zobrazit tento text v případě, že údaj nebyl předsán.

source: The "%(key)s" must be a dictionary type: "%(key)s": {"essential": true},
cs: Položka "%(key)s" musí být typu slovnik: "%(key)s": {"essential": true},

source: The "%(key)s" value must contain key "essential": "%(key)s": {"essential": true},
cs: Položka "%(key)s" musí obsahovat klíč "essential": "%(key)s": {"essential": true},

source: The account has been successfully paired with the provider.
cs: Účet byl úspěšně spárován s poskytovatelem.

source: The list of names is scrolled in the specified order until the value is found. For names composed of a plus sign, the value consist of them.
cs: Prochází se seznam názvů atributů podle zadaného pořadí, dokud není nalezena hodnota. U názvů složených symbolem plus se údaje složí do jedné hodnoty.

source: The value "userinfo" must be a dictionary type: {"userinfo": ...}
cs: Hodnota "userinfo" musí být typu slovnik: {"userinfo": ...}

source: The value is required if "Register consumer" is not set.
cs: Hodnota je povinná, pokud není nastaveno "Registrovat odběratele".

source: The value must be a dictionary type: {}
cs: Hodnota musí být typu slovnik: {}

source: The value of "essential" must be a boolean type": "%(key)s": {"essential": true},
cs: Hodnota "essential" musí být typu boolean": "%(key)s": {"essential": true},

source: This plugin is only used to handover data from the identity provider. Use the "OIDC Login" plugin to log users in.
cs: Tento plugin slouží pouze k předání dat od poskytovatele identity. Chcete-li uživatele přihlásit, použijte plugin "OIDC Přihlášení".

source: This plugin is used to log in a user through authentication with an identity provider. If you only want to handover data from the identity provider, but not log in the user, use the "OIDC Handover data". Caution! If the plugin creates new users! If you do not want to create them, check the "No new user" radio button. When this switch is checked, the plugin pairs the identity from the provider with the logged in user.
cs: Tento plugin slouží k přihlášení uživatele přes ověření u poskytovatele identity. Chcete-li pouze od poskytovatele identity předat údaje, ale uživatele nepřihlašovat, tak použijte plugin "OIDC Předání údajů". Pozor! Plugin vytváří nové uživatele! Pokud je vytvářet nechcete, tak zatrhněte přepínač "Ne nový uživatel". Při zatržení tohoto přepínače plugin spáruje identitu od poskytovatele s přihlášeným uživatelem.

source: This plugin shows the logged in user the identity from the provider paired with his account. The user can delete them.
cs: Tento plugin zobrazuje přihlášenému uživateli identity od poskytovatele spárované s jeho účtem. Uživatel je může smazat.

source: To pair with your identity provider, log in first.
cs: Pro spárování s vaším poskytovatelem identity se nejdříve přihlašte.

source: To pair your account with an identity provider, sign in first.
cs: Pro spárování vašeho účtu s poskytovatelem identity se nejdříve přihlašte.

source: Token endpoint
cs: Koncový bod tokenu

source: Update data
cs: Aktualizovat údaje

source: Used, for example, as a css class for a button or link.
cs: Použito, například, jako css třída pro tlačítko nebo odkaz.

source: User
cs: Uživatel

source: User endpoint
cs: Koncový bod uživatele

source: Verified by names
cs: Ověření podle názvů

source: Verified by names (separated by space).
cs: Ověření přes názvy (položky oddělené mezerou).

source: Verified by names (separated by space). Eg.: name given_name+family_name preferred_username nickname email openid2_id
cs: Ověření přes názvy (položky oddělené mezerou). Např. name given_name+family_name preferred_username nickname email openid2_id

source: Verified by names:
cs: Ověření podle položek:

source: You are verified as
cs: Jste ověřeni jako

source: You can also log out of provider <a href="%(logout_url)s" class="djangocms-oidc-logout %(provider_slug)s">%(provider_name)s</a> if you wish.
cs: Chcete-li, můžete se také od poskytovatele <a href="%(logout_url)s" class="djangocms-oidc-logout %(provider_slug)s">%(provider_name)s</a> odhlásit.

source: You have no identifiers associated with the provider.
cs: Nemáte žádné identifikátory navázané k poskytovateli.

source: Your account is deactivated. Please contact our support.
cs: Váš účet je deaktivován. Prosím kontaktujte naši podporu.
