gap> k_:=PureCubicalKnot(3,1);                  
prime knot 1 with 3 crossings

gap> arc:=ArcPresentation(k_);                  
[ [ 2, 5 ], [ 1, 3 ], [ 2, 4 ], [ 3, 5 ], [ 1, 4 ] ]
gap> k_:=RegularCWComplex(PureComplexComplement(k_));
Regular CW-complex of dimension 3

gap> Size(k_);
13291
gap> k:=KnotComplement(arc);                                         
Regular CW-complex of dimension 3

gap> Size(k);
395
