Repository: pypi-data/pypi-mirror-386
Catalog: packages/pyams-zmi/pyams_zmi-2.6.2-py3-none-any.whl/pyams_zmi/locales/*/LC_MESSAGES/pyams_zmi.po
Languages: fr

source: PyAMS management skin
fr: PyAMS: skin MyAMS

source: Name
fr: Nom

source: Click to show/hide item
fr: Cliquez pour afficher/masquer cet élément

source: This element is visible
fr: Cet élément est visible

source: This element is not visible
fr: Cet élément n'est pas visible

source: Delete element
fr: Supprimer cet élément

source: Search form
fr: Rechercher

source: Search criteria
fr: Critères de recherche

source: Graphic theme
fr: Thème graphique

source: Skin properties
fr: Propriétés du thème graphique

source: Home
fr: Accueil

source: ZMI configuration
fr: Configuration ZMI

source: Interface configuration
fr: Interface d'administration

source: Warning!
fr: ATTENTION !

source: Removing navigation menus will also remove access to this form...
fr: En supprimant les menus de navigation, vous supprimerez également l'accès à ce formulaire !!

source: Custom extensions
fr: Personnalisation

source: Blobs references manager
fr: Gestionnaire de blobs

source: Internal IDs
fr: Identifiants internes

source: Server timezone
fr: Fuseau horaire

source: Principals annotations
fr: Profils utilisateurs

source: Utilities
fr: Utilitaires

source: Control panel
fr: Panneau de configuration

source: Site utilities
fr: Utilitaires

source: Component
fr: Composant

source: Local registry
fr: Registre local

source: The local registry is used to store 'local' utilities, whose configuration is stored into the ZODB. Some of these utilities have important settings which can define the whole application behaviour. Some of these components are created automatically, while other ones are created by sites managers, like SQLAlchemy or ZODB connections.
fr: Le registre local est utilisé pour enregistrer des utilitaires dont la définition et le paramétrage sont stockés dans la ZODB. Certains de ces utilitaires ont des paramètres importants qui déterminent le mode de fonctionnement de toute l'application. Certains de ces composants sont créés automatiquement (via la commande *pyams_upgrade*), tandis que d'autres tels que les connexions SQLAlchemy ou ZEO sont créés manuellement par les administrateurs en fonction des besoins.

source: Global registry
fr: Registre global

source: The global registry is used to store utilities which are defined statically in Python code or using ZCML directives.
fr: Le registre global est utilisé pour enregistrer des composants généralement statiques, qui sont chargés au démarrage de l'application via des scripts en Python ou des directives ZCML.

source: User profile
fr: Mon profil

source: My user profile
fr: Mon profil utilisateur

source: Use default theme
fr: Utiliser le thème par défaut

source: Environment
fr: Environnement

source: Application runtime environment
fr: Environnement de l'application

source: Package name
fr: Nom du package

source: Path
fr: Chemin

source: Packages versions
fr: Packages Python

source: Variable name
fr: Nom de la variable

source: Value
fr: Valeur

source: Environment variables
fr: Variables d'environnement

source: Setting name
fr: Nom du paramètre

source: Configuration settings
fr: Paramètres de configuration

source: Properties
fr: Propriétés

source: Swagger API
fr: API Swagger

source: Add...
fr: Ajouter...

source: PyAMS admin page
fr: PyAMS

source: Content management
fr: Gestion de contenu

source: Site management
fr: Gestion du site

source: Logout
fr: Déconnexion

source: Show/hide navigation menus
fr: Afficher/masquer les menus de navigation

source: Minify menus
fr: Réduire les menus

source: Search...
fr: Rechercher...

source: MyAMS full bundle
fr: MyAMS full bundle (Thème MyAMS en version complète, avec icônes CSS)

source: MyAMS mini bundle (with CSS icons)
fr: MyAMS mini-css (Thème MyAMS en version minimale, avec icônes CSS)

source: MyAMS mini bundle (with SVG icons)
fr: MyAMS mini-svg (Thème MyAMS en version minimale, avec icônes SVG)

source: MyAMS core bundle (with CSS icons)
fr: MyAMS core-css (Thème MyAMS en version core, avec icônes CSS)

source: MyAMS core bundle (with SVG icons)
fr: MyAMS core-svg (Thème MyAMS en version core, avec icônes SVG)

source: Emerald full bundle
fr: Emerald full bundle (Thème Emerald en version complète, avec icônes CSS)

source: Emerald mini bundle (with CSS icons)
fr: Emerald mini-css (Thème Emerald en version minimale, avec icônes CSS)

source: Emerald mini bundle (with SVG icons)
fr: Emerald mini-svg (Thème Emerald en version minimale, avec icônes SVG)

source: Emerald core bundle (with CSS icons)
fr: Emerald core-css (Thème Emerald en version core, avec icônes CSS)

source: Emerald core bundle (with SVG icons)
fr: Emerald core-svg (Thème Emerald en version core, avec icônes SVG)

source: Dark mode full bundle
fr: DarkMode full bundle (Thème sombre en version complète, avec icônes CSS)

source: Dark mode mini bundle (with CSS icons)
fr: DarkMode mini-css (Thème sombre en version minimale, avec icônes CSS)

source: Dark mode mini bundle (with SVG icons)
fr: DarkMode mini-svg (Thème sombre en version minimale, avec icônes SVG)

source: Dark mode core bundle (with CSS icons)
fr: DarkMode core-css (Thème sombre en version core, avec icônes CSS)

source: Dark mode core bundle (with SVG icons)
fr: DarkMode core-svg (Thème sombre en version core, avec icônes SVG)

source: Light mode full bundle
fr: LightMode full bundle (Thème clair en version complète, avec icônes CSS)

source: Light mode mini bundle (with CSS icons)
fr: LightMode mini-css (Thème clair en version minimale, avec icônes CSS)

source: Light mode mini bundle (with SVG icons)
fr: LightMode mini-svg (Thème clair en version minimale, avec icônes SVG)

source: Light mode core bundle (with CSS icons)
fr: LightMode core-css (Thème clair en version core, avec icônes CSS)

source: Light mode core bundle (with SVG icons)
fr: LightMode core-svg (Thème clair en version core, avec icônes SVG)

source: Site name
fr: Nom du site

source: Home name
fr: Racine du site

source: Label used to get access to site's root in breadcrumbs link
fr: Libellé indiqué dans le fil d'Ariane pour accéder à la racine du site

source: Application name
fr: Nom de l'application

source: Application package
fr: Package de l'application

source: Name of the main package used to get application version
fr: Nom du package Python principal correspondant au nom de l'application

source: Secondary name
fr: Complément

source: Secondary package
fr: Package complétaire

source: Name of the secondary package used to complete application version
fr: Nom du package Python utilisé pour compléter l'affichage du numéro de version

source: Environment name
fr: Environnement

source: Short text used to describe runtime environment
fr: Court texte de description de l'environnement d'exécution

source: MyAMS bundle
fr: Thème graphique

source: MyAMS bundle used by the application
fr: Thème graphique et mode de packaging par défaut du framework MyAMS utilisé par l'application

source: Allow bundle selection from user profile
fr: Autoriser l'utilisateur à choisir son thème graphique

source: If 'yes', bundle and theme selections will be available from user profile
fr: Si 'oui', le choix du thème et du mode de packaging sera disponible dans le profil de l'utilisateur

source: User selected bundles
fr: Thèmes proposés

source: List of bundles which can be selected from user profile
fr: Seules les options sélectionnées ici seront proposées à l'utilisateur au sein de son profil

source: Icon
fr: Icône

source: Favorites icon
fr: Icône des favoris

source: Include header
fr: Inclure le bandeau supérieur

source: Fixed header
fr: Bandeau fixe

source: If selected, the header will not scroll but will stay fixed at the top of the screen
fr: Cette option permet de maintenir le bandeau visible en haut de la fenêtre lorsque l'utilisateur fait défiler les contenus

source: Logo image
fr: Logo

source: SVG or bitmap image used as logo
fr: Image bitmap ou SVG utilisée pour afficher le logo

source: Include site search
fr: Inclure la recherche

source: Include a global site search access link in page header
fr: Inclure une zone de recherche globale dans le bandeau supérieur

source: Site search placeholder
fr: Texte d'attente de la zone de recherche

source: Site search handler
fr: Cible de la recherche

source: Include navigation menus
fr: Inclure les menus de navigation

source: Include minify buttons
fr: Inclure les boutons de réduction

source: If selected, this will provide features to reduce or hide navigation menus
fr: Cette option permet de fournir des fonctions de réduction ou de masquage des menus de navigation

source: Fixed menus
fr: Menus fixes

source: Accordion menus
fr: Menus en accordéon

source: If selected, only one navigation menu can be opened at a given time
fr: Cette option empêche l'ouverture simultanée de plusieurs menus

source: Include ribbon
fr: Inclure le ruban

source: Display breadcrumbs ribbon?
fr: Afficher le ruban contenant le fil d'Ariane

source: Fixed ribon
fr: Ruban fixe

source: If selected, the ribbon will not scroll but will stay fixed at the top of the page
fr: Cette option empêche le défilement du ruban en tête de page

source: Base body CSS class
fr: Classe CSS du body

source: Custom stylesheet
fr: Feuille de style spécifique

source: Custom stylesheet used to override or extend default MyAMS management skin
fr: Vous pouvez fournir une feuille de style spécifique pour surcharger ou compléter le thème graphique de l'interface d'administration

source: Custom script
fr: Script personnalisé

source: Custom javascript used to override or extend default MyAMS modules
fr: Vous pouvez fournir un script spécifique pour surcharger ou compléter les fonctionnalités de l'interface d'administration

source: Switcher legend
fr: Légende du switch

source: Add
fr: Ajouter

source: Reset
fr: Annuler

source: Cancel
fr: Annuler

source: Apply
fr: Enregistrer

source: Search for
fr: Texte recherché

source: Search
fr: Chercher

source: Profile's avatar
fr: Avatar

source: This picture will be associated to your user profile
fr: Vous pouvez sélectionner une image qui sera associée à votre profil utilisateur

source: Graphical theme
fr: Thème graphique

source: You can choose a custom theme between those provided in this selection list
fr: Vous pouvez sélectionner un thème graphique parmi ceux qui ont été mis à votre disposition

source: Default tables length
fr: Longueur des tableaux

source: Default length of tables displayed by management interface
fr: Longueur de page par défaut des tableaux affichés dans l'interface d'administration

source: Back to previous page
fr: Revenir à la page précédente

source: WARNING: only the first ${length} results are displayed in this table!
fr: ATTENTION : la liste est tronquée, seuls les ${length} premiers résultats sont affichés !

source: This table is empty.
fr: Cette table ne contient aucun élément.

source: No provided object_name argument!
fr: Le nom de l'objet à mettre à jour n'a pas été renseigné !

source: Given element name doesn't exist!
fr: L'élément sélectionné n'existe pas !

source: Element was deleted successfully.
fr: L'élément a été supprimé avec succès.

source: No provided attribute name!
fr: Le nom de l'attribut à mettre à jour n'a pas été renseigné !

source: Element was updated successfully.
fr: L'élément a été modifié avec succès.
