Repository: pypi-data/pypi-mirror-386
Catalog: packages/djangocms-aldryn-forms/djangocms_aldryn_forms-8.3.1.tar.gz/djangocms_aldryn_forms-8.3.1/aldryn_forms/locale/*/LC_MESSAGES/djangojs.po
Languages: cs

source: Correct the errors first, please.
cs: Prosím, nejdříve opravte chyby.

source: File size
cs: Velikost souboru

source: Max. %s file with a total size of max. %s
cs: Max. %s soubor o celkové velikosti max. %s

source: Max. size
cs: Max. velikost

source: Please wait. Submitting form...
cs: Prosím čekejte. Formulář se odesílá...

source: Remove file.
cs: Odebrat soubor.

source: The file size has exceeded the specified limit.
cs: Velikost souboru přesáhla stanovený limit.

source: The file type is not among the accpeted types.
cs: Typ souboru není mezi povolenými typy.

source: The total size of all files has exceeded the specified limit.
cs: Celková velikost všech souborů přesáhla stanovený limit.

source: This file exceeds the uploaded files limit.
cs: Tento soubor překračuje limit souborů pro nahrání.

source: You have to choose at least %(value)s option (chosen %(chosen)s).
cs: Musíte vybrat nejméně %(value)s položku (vybráno %(chosen)s).
